/* automatically generated by rust-bindgen 0.60.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_COLOR_ACCESS_BIT_ARM:
    VkSubpassDescriptionFlagBits = 16;
pub const VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_DEPTH_ACCESS_BIT_ARM:
    VkSubpassDescriptionFlagBits = 32;
pub const VK_SUBPASS_DESCRIPTION_RASTERIZATION_ORDER_ATTACHMENT_STENCIL_ACCESS_BIT_ARM:
    VkSubpassDescriptionFlagBits = 64;
pub const VK_SUBPASS_DESCRIPTION_FLAG_BITS_MAX_ENUM: VkSubpassDescriptionFlagBits = 2147483647;
pub type VkSubpassDescriptionFlagBits = ::std::os::raw::c_int;
pub type VkSubpassDescriptionFlags = VkFlags;
pub const VK_COMMAND_POOL_CREATE_TRANSIENT_BIT: VkCommandPoolCreateFlagBits = 1;
pub const VK_COMMAND_POOL_CREATE_RESET_COMMAND_BUFFER_BIT: VkCommandPoolCreateFlagBits = 2;
pub const VK_COMMAND_POOL_CREATE_PROTECTED_BIT: VkCommandPoolCreateFlagBits = 4;
pub const VK_COMMAND_POOL_CREATE_FLAG_BITS_MAX_ENUM: VkCommandPoolCreateFlagBits = 2147483647;
pub type VkCommandPoolCreateFlagBits = ::std::os::raw::c_int;
pub type VkCommandPoolCreateFlags = VkFlags;
pub const VK_COMMAND_POOL_RESET_RELEASE_RESOURCES_BIT: VkCommandPoolResetFlagBits = 1;
pub const VK_COMMAND_POOL_RESET_FLAG_BITS_MAX_ENUM: VkCommandPoolResetFlagBits = 2147483647;
pub type VkCommandPoolResetFlagBits = ::std::os::raw::c_int;
pub type VkCommandPoolResetFlags = VkFlags;
pub const VK_COMMAND_BUFFER_USAGE_ONE_TIME_SUBMIT_BIT: VkCommandBufferUsageFlagBits = 1;
pub const VK_COMMAND_BUFFER_USAGE_RENDER_PASS_CONTINUE_BIT: VkCommandBufferUsageFlagBits = 2;
pub const VK_COMMAND_BUFFER_USAGE_SIMULTANEOUS_USE_BIT: VkCommandBufferUsageFlagBits = 4;
pub const VK_COMMAND_BUFFER_USAGE_FLAG_BITS_MAX_ENUM: VkCommandBufferUsageFlagBits = 2147483647;
pub type VkCommandBufferUsageFlagBits = ::std::os::raw::c_int;
pub type VkCommandBufferUsageFlags = VkFlags;
pub const VK_QUERY_CONTROL_PRECISE_BIT: VkQueryControlFlagBits = 1;
pub const VK_QUERY_CONTROL_FLAG_BITS_MAX_ENUM: VkQueryControlFlagBits = 2147483647;
pub type VkQueryControlFlagBits = ::std::os::raw::c_int;
pub type VkQueryControlFlags = VkFlags;
pub const VK_COMMAND_BUFFER_RESET_RELEASE_RESOURCES_BIT: VkCommandBufferResetFlagBits = 1;
pub const VK_COMMAND_BUFFER_RESET_FLAG_BITS_MAX_ENUM: VkCommandBufferResetFlagBits = 2147483647;
pub type VkCommandBufferResetFlagBits = ::std::os::raw::c_int;
pub type VkCommandBufferResetFlags = VkFlags;
pub const VK_STENCIL_FACE_FRONT_BIT: VkStencilFaceFlagBits = 1;
pub const VK_STENCIL_FACE_BACK_BIT: VkStencilFaceFlagBits = 2;
pub const VK_STENCIL_FACE_FRONT_AND_BACK: VkStencilFaceFlagBits = 3;
pub const VK_STENCIL_FRONT_AND_BACK: VkStencilFaceFlagBits = 3;
pub const VK_STENCIL_FACE_FLAG_BITS_MAX_ENUM: VkStencilFaceFlagBits = 2147483647;
pub type VkStencilFaceFlagBits = ::std::os::raw::c_int;
pub type VkStencilFaceFlags = VkFlags;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkExtent2D {
    pub width: u32,
    pub height: u32,
}
#[test]
fn bindgen_test_layout_VkExtent2D() {
    assert_eq!(
        ::std::mem::size_of::<VkExtent2D>(),
        8usize,
        concat!("Size of: ", stringify!(VkExtent2D))
    );
    assert_eq!(
        ::std::mem::align_of::<VkExtent2D>(),
        4usize,
        concat!("Alignment of ", stringify!(VkExtent2D))
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtent2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtent2D),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtent2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtent2D),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkExtent3D {
    pub width: u32,
    pub height: u32,
    pub depth: u32,
}
#[test]
fn bindgen_test_layout_VkExtent3D() {
    assert_eq!(
        ::std::mem::size_of::<VkExtent3D>(),
        12usize,
        concat!("Size of: ", stringify!(VkExtent3D))
    );
    assert_eq!(
        ::std::mem::align_of::<VkExtent3D>(),
        4usize,
        concat!("Alignment of ", stringify!(VkExtent3D))
    );
    fn test_field_width() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtent3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtent3D),
                "::",
                stringify!(width)
            )
        );
    }
    test_field_width();
    fn test_field_height() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtent3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtent3D),
                "::",
                stringify!(height)
            )
        );
    }
    test_field_height();
    fn test_field_depth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtent3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtent3D),
                "::",
                stringify!(depth)
            )
        );
    }
    test_field_depth();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkOffset2D {
    pub x: i32,
    pub y: i32,
}
#[test]
fn bindgen_test_layout_VkOffset2D() {
    assert_eq!(
        ::std::mem::size_of::<VkOffset2D>(),
        8usize,
        concat!("Size of: ", stringify!(VkOffset2D))
    );
    assert_eq!(
        ::std::mem::align_of::<VkOffset2D>(),
        4usize,
        concat!("Alignment of ", stringify!(VkOffset2D))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkOffset2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkOffset2D),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkOffset2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkOffset2D),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkOffset3D {
    pub x: i32,
    pub y: i32,
    pub z: i32,
}
#[test]
fn bindgen_test_layout_VkOffset3D() {
    assert_eq!(
        ::std::mem::size_of::<VkOffset3D>(),
        12usize,
        concat!("Size of: ", stringify!(VkOffset3D))
    );
    assert_eq!(
        ::std::mem::align_of::<VkOffset3D>(),
        4usize,
        concat!("Alignment of ", stringify!(VkOffset3D))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkOffset3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkOffset3D),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkOffset3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkOffset3D),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkOffset3D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkOffset3D),
                "::",
                stringify!(z)
            )
        );
    }
    test_field_z();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkRect2D {
    pub offset: VkOffset2D,
    pub extent: VkExtent2D,
}
#[test]
fn bindgen_test_layout_VkRect2D() {
    assert_eq!(
        ::std::mem::size_of::<VkRect2D>(),
        16usize,
        concat!("Size of: ", stringify!(VkRect2D))
    );
    assert_eq!(
        ::std::mem::align_of::<VkRect2D>(),
        4usize,
        concat!("Alignment of ", stringify!(VkRect2D))
    );
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkRect2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkRect2D),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_extent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkRect2D>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkRect2D),
                "::",
                stringify!(extent)
            )
        );
    }
    test_field_extent();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBaseInStructure {
    pub sType: VkStructureType,
    pub pNext: *const VkBaseInStructure,
}
#[test]
fn bindgen_test_layout_VkBaseInStructure() {
    assert_eq!(
        ::std::mem::size_of::<VkBaseInStructure>(),
        16usize,
        concat!("Size of: ", stringify!(VkBaseInStructure))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBaseInStructure>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBaseInStructure))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBaseInStructure>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBaseInStructure),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBaseInStructure>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBaseInStructure),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
}
impl Default for VkBaseInStructure {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBaseOutStructure {
    pub sType: VkStructureType,
    pub pNext: *mut VkBaseOutStructure,
}
#[test]
fn bindgen_test_layout_VkBaseOutStructure() {
    assert_eq!(
        ::std::mem::size_of::<VkBaseOutStructure>(),
        16usize,
        concat!("Size of: ", stringify!(VkBaseOutStructure))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBaseOutStructure>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBaseOutStructure))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBaseOutStructure>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBaseOutStructure),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBaseOutStructure>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBaseOutStructure),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
}
impl Default for VkBaseOutStructure {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBufferMemoryBarrier {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub srcAccessMask: VkAccessFlags,
    pub dstAccessMask: VkAccessFlags,
    pub srcQueueFamilyIndex: u32,
    pub dstQueueFamilyIndex: u32,
    pub buffer: VkBuffer,
    pub offset: VkDeviceSize,
    pub size: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkBufferMemoryBarrier() {
    assert_eq!(
        ::std::mem::size_of::<VkBufferMemoryBarrier>(),
        56usize,
        concat!("Size of: ", stringify!(VkBufferMemoryBarrier))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBufferMemoryBarrier>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBufferMemoryBarrier))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_srcAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).srcAccessMask) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(srcAccessMask)
            )
        );
    }
    test_field_srcAccessMask();
    fn test_field_dstAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dstAccessMask) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(dstAccessMask)
            )
        );
    }
    test_field_dstAccessMask();
    fn test_field_srcQueueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).srcQueueFamilyIndex) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(srcQueueFamilyIndex)
            )
        );
    }
    test_field_srcQueueFamilyIndex();
    fn test_field_dstQueueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dstQueueFamilyIndex) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(dstQueueFamilyIndex)
            )
        );
    }
    test_field_dstQueueFamilyIndex();
    fn test_field_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(buffer)
            )
        );
    }
    test_field_buffer();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferMemoryBarrier),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
}
impl Default for VkBufferMemoryBarrier {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkDispatchIndirectCommand {
    pub x: u32,
    pub y: u32,
    pub z: u32,
}
#[test]
fn bindgen_test_layout_VkDispatchIndirectCommand() {
    assert_eq!(
        ::std::mem::size_of::<VkDispatchIndirectCommand>(),
        12usize,
        concat!("Size of: ", stringify!(VkDispatchIndirectCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<VkDispatchIndirectCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(VkDispatchIndirectCommand))
    );
    fn test_field_x() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDispatchIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDispatchIndirectCommand),
                "::",
                stringify!(x)
            )
        );
    }
    test_field_x();
    fn test_field_y() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDispatchIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDispatchIndirectCommand),
                "::",
                stringify!(y)
            )
        );
    }
    test_field_y();
    fn test_field_z() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDispatchIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDispatchIndirectCommand),
                "::",
                stringify!(z)
            )
        );
    }
    test_field_z();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkDrawIndexedIndirectCommand {
    pub indexCount: u32,
    pub instanceCount: u32,
    pub firstIndex: u32,
    pub vertexOffset: i32,
    pub firstInstance: u32,
}
#[test]
fn bindgen_test_layout_VkDrawIndexedIndirectCommand() {
    assert_eq!(
        ::std::mem::size_of::<VkDrawIndexedIndirectCommand>(),
        20usize,
        concat!("Size of: ", stringify!(VkDrawIndexedIndirectCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<VkDrawIndexedIndirectCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(VkDrawIndexedIndirectCommand))
    );
    fn test_field_indexCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndexedIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).indexCount) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndexedIndirectCommand),
                "::",
                stringify!(indexCount)
            )
        );
    }
    test_field_indexCount();
    fn test_field_instanceCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndexedIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instanceCount) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndexedIndirectCommand),
                "::",
                stringify!(instanceCount)
            )
        );
    }
    test_field_instanceCount();
    fn test_field_firstIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndexedIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firstIndex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndexedIndirectCommand),
                "::",
                stringify!(firstIndex)
            )
        );
    }
    test_field_firstIndex();
    fn test_field_vertexOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndexedIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vertexOffset) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndexedIndirectCommand),
                "::",
                stringify!(vertexOffset)
            )
        );
    }
    test_field_vertexOffset();
    fn test_field_firstInstance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndexedIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firstInstance) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndexedIndirectCommand),
                "::",
                stringify!(firstInstance)
            )
        );
    }
    test_field_firstInstance();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkDrawIndirectCommand {
    pub vertexCount: u32,
    pub instanceCount: u32,
    pub firstVertex: u32,
    pub firstInstance: u32,
}
#[test]
fn bindgen_test_layout_VkDrawIndirectCommand() {
    assert_eq!(
        ::std::mem::size_of::<VkDrawIndirectCommand>(),
        16usize,
        concat!("Size of: ", stringify!(VkDrawIndirectCommand))
    );
    assert_eq!(
        ::std::mem::align_of::<VkDrawIndirectCommand>(),
        4usize,
        concat!("Alignment of ", stringify!(VkDrawIndirectCommand))
    );
    fn test_field_vertexCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vertexCount) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndirectCommand),
                "::",
                stringify!(vertexCount)
            )
        );
    }
    test_field_vertexCount();
    fn test_field_instanceCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instanceCount) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndirectCommand),
                "::",
                stringify!(instanceCount)
            )
        );
    }
    test_field_instanceCount();
    fn test_field_firstVertex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firstVertex) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndirectCommand),
                "::",
                stringify!(firstVertex)
            )
        );
    }
    test_field_firstVertex();
    fn test_field_firstInstance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDrawIndirectCommand>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).firstInstance) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDrawIndirectCommand),
                "::",
                stringify!(firstInstance)
            )
        );
    }
    test_field_firstInstance();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkImageSubresourceRange {
    pub aspectMask: VkImageAspectFlags,
    pub baseMipLevel: u32,
    pub levelCount: u32,
    pub baseArrayLayer: u32,
    pub layerCount: u32,
}
#[test]
fn bindgen_test_layout_VkImageSubresourceRange() {
    assert_eq!(
        ::std::mem::size_of::<VkImageSubresourceRange>(),
        20usize,
        concat!("Size of: ", stringify!(VkImageSubresourceRange))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageSubresourceRange>(),
        4usize,
        concat!("Alignment of ", stringify!(VkImageSubresourceRange))
    );
    fn test_field_aspectMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresourceRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspectMask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresourceRange),
                "::",
                stringify!(aspectMask)
            )
        );
    }
    test_field_aspectMask();
    fn test_field_baseMipLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresourceRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseMipLevel) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresourceRange),
                "::",
                stringify!(baseMipLevel)
            )
        );
    }
    test_field_baseMipLevel();
    fn test_field_levelCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresourceRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).levelCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresourceRange),
                "::",
                stringify!(levelCount)
            )
        );
    }
    test_field_levelCount();
    fn test_field_baseArrayLayer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresourceRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).baseArrayLayer) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresourceRange),
                "::",
                stringify!(baseArrayLayer)
            )
        );
    }
    test_field_baseArrayLayer();
    fn test_field_layerCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresourceRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).layerCount) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresourceRange),
                "::",
                stringify!(layerCount)
            )
        );
    }
    test_field_layerCount();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkImageMemoryBarrier {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub srcAccessMask: VkAccessFlags,
    pub dstAccessMask: VkAccessFlags,
    pub oldLayout: VkImageLayout,
    pub newLayout: VkImageLayout,
    pub srcQueueFamilyIndex: u32,
    pub dstQueueFamilyIndex: u32,
    pub image: VkImage,
    pub subresourceRange: VkImageSubresourceRange,
}
#[test]
fn bindgen_test_layout_VkImageMemoryBarrier() {
    assert_eq!(
        ::std::mem::size_of::<VkImageMemoryBarrier>(),
        72usize,
        concat!("Size of: ", stringify!(VkImageMemoryBarrier))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageMemoryBarrier>(),
        8usize,
        concat!("Alignment of ", stringify!(VkImageMemoryBarrier))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_srcAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).srcAccessMask) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(srcAccessMask)
            )
        );
    }
    test_field_srcAccessMask();
    fn test_field_dstAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dstAccessMask) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(dstAccessMask)
            )
        );
    }
    test_field_dstAccessMask();
    fn test_field_oldLayout() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).oldLayout) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(oldLayout)
            )
        );
    }
    test_field_oldLayout();
    fn test_field_newLayout() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).newLayout) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(newLayout)
            )
        );
    }
    test_field_newLayout();
    fn test_field_srcQueueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).srcQueueFamilyIndex) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(srcQueueFamilyIndex)
            )
        );
    }
    test_field_srcQueueFamilyIndex();
    fn test_field_dstQueueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dstQueueFamilyIndex) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(dstQueueFamilyIndex)
            )
        );
    }
    test_field_dstQueueFamilyIndex();
    fn test_field_image() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).image) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(image)
            )
        );
    }
    test_field_image();
    fn test_field_subresourceRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subresourceRange) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageMemoryBarrier),
                "::",
                stringify!(subresourceRange)
            )
        );
    }
    test_field_subresourceRange();
}
impl Default for VkImageMemoryBarrier {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkMemoryBarrier {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub srcAccessMask: VkAccessFlags,
    pub dstAccessMask: VkAccessFlags,
}
#[test]
fn bindgen_test_layout_VkMemoryBarrier() {
    assert_eq!(
        ::std::mem::size_of::<VkMemoryBarrier>(),
        24usize,
        concat!("Size of: ", stringify!(VkMemoryBarrier))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMemoryBarrier>(),
        8usize,
        concat!("Alignment of ", stringify!(VkMemoryBarrier))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryBarrier),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryBarrier),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_srcAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).srcAccessMask) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryBarrier),
                "::",
                stringify!(srcAccessMask)
            )
        );
    }
    test_field_srcAccessMask();
    fn test_field_dstAccessMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryBarrier>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dstAccessMask) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryBarrier),
                "::",
                stringify!(dstAccessMask)
            )
        );
    }
    test_field_dstAccessMask();
}
impl Default for VkMemoryBarrier {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPipelineCacheHeaderVersionOne {
    pub headerSize: u32,
    pub headerVersion: VkPipelineCacheHeaderVersion,
    pub vendorID: u32,
    pub deviceID: u32,
    pub pipelineCacheUUID: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_VkPipelineCacheHeaderVersionOne() {
    assert_eq!(
        ::std::mem::size_of::<VkPipelineCacheHeaderVersionOne>(),
        32usize,
        concat!("Size of: ", stringify!(VkPipelineCacheHeaderVersionOne))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPipelineCacheHeaderVersionOne>(),
        4usize,
        concat!("Alignment of ", stringify!(VkPipelineCacheHeaderVersionOne))
    );
    fn test_field_headerSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPipelineCacheHeaderVersionOne>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).headerSize) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPipelineCacheHeaderVersionOne),
                "::",
                stringify!(headerSize)
            )
        );
    }
    test_field_headerSize();
    fn test_field_headerVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPipelineCacheHeaderVersionOne>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).headerVersion) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPipelineCacheHeaderVersionOne),
                "::",
                stringify!(headerVersion)
            )
        );
    }
    test_field_headerVersion();
    fn test_field_vendorID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPipelineCacheHeaderVersionOne>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vendorID) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPipelineCacheHeaderVersionOne),
                "::",
                stringify!(vendorID)
            )
        );
    }
    test_field_vendorID();
    fn test_field_deviceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPipelineCacheHeaderVersionOne>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceID) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPipelineCacheHeaderVersionOne),
                "::",
                stringify!(deviceID)
            )
        );
    }
    test_field_deviceID();
    fn test_field_pipelineCacheUUID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPipelineCacheHeaderVersionOne>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pipelineCacheUUID) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPipelineCacheHeaderVersionOne),
                "::",
                stringify!(pipelineCacheUUID)
            )
        );
    }
    test_field_pipelineCacheUUID();
}
impl Default for VkPipelineCacheHeaderVersionOne {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type PFN_vkAllocationFunction = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        size: usize,
        alignment: usize,
        allocationScope: VkSystemAllocationScope,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type PFN_vkFreeFunction = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        pMemory: *mut ::std::os::raw::c_void,
    ),
>;
pub type PFN_vkInternalAllocationNotification = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        size: usize,
        allocationType: VkInternalAllocationType,
        allocationScope: VkSystemAllocationScope,
    ),
>;
pub type PFN_vkInternalFreeNotification = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        size: usize,
        allocationType: VkInternalAllocationType,
        allocationScope: VkSystemAllocationScope,
    ),
>;
pub type PFN_vkReallocationFunction = ::std::option::Option<
    unsafe extern "C" fn(
        pUserData: *mut ::std::os::raw::c_void,
        pOriginal: *mut ::std::os::raw::c_void,
        size: usize,
        alignment: usize,
        allocationScope: VkSystemAllocationScope,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type PFN_vkVoidFunction = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkAllocationCallbacks {
    pub pUserData: *mut ::std::os::raw::c_void,
    pub pfnAllocation: PFN_vkAllocationFunction,
    pub pfnReallocation: PFN_vkReallocationFunction,
    pub pfnFree: PFN_vkFreeFunction,
    pub pfnInternalAllocation: PFN_vkInternalAllocationNotification,
    pub pfnInternalFree: PFN_vkInternalFreeNotification,
}
#[test]
fn bindgen_test_layout_VkAllocationCallbacks() {
    assert_eq!(
        ::std::mem::size_of::<VkAllocationCallbacks>(),
        48usize,
        concat!("Size of: ", stringify!(VkAllocationCallbacks))
    );
    assert_eq!(
        ::std::mem::align_of::<VkAllocationCallbacks>(),
        8usize,
        concat!("Alignment of ", stringify!(VkAllocationCallbacks))
    );
    fn test_field_pUserData() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pUserData) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pUserData)
            )
        );
    }
    test_field_pUserData();
    fn test_field_pfnAllocation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pfnAllocation) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pfnAllocation)
            )
        );
    }
    test_field_pfnAllocation();
    fn test_field_pfnReallocation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pfnReallocation) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pfnReallocation)
            )
        );
    }
    test_field_pfnReallocation();
    fn test_field_pfnFree() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pfnFree) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pfnFree)
            )
        );
    }
    test_field_pfnFree();
    fn test_field_pfnInternalAllocation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pfnInternalAllocation) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pfnInternalAllocation)
            )
        );
    }
    test_field_pfnInternalAllocation();
    fn test_field_pfnInternalFree() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkAllocationCallbacks>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pfnInternalFree) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkAllocationCallbacks),
                "::",
                stringify!(pfnInternalFree)
            )
        );
    }
    test_field_pfnInternalFree();
}
impl Default for VkAllocationCallbacks {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkApplicationInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub pApplicationName: *const ::std::os::raw::c_char,
    pub applicationVersion: u32,
    pub pEngineName: *const ::std::os::raw::c_char,
    pub engineVersion: u32,
    pub apiVersion: u32,
}
#[test]
fn bindgen_test_layout_VkApplicationInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkApplicationInfo>(),
        48usize,
        concat!("Size of: ", stringify!(VkApplicationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkApplicationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkApplicationInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_pApplicationName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pApplicationName) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(pApplicationName)
            )
        );
    }
    test_field_pApplicationName();
    fn test_field_applicationVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).applicationVersion) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(applicationVersion)
            )
        );
    }
    test_field_applicationVersion();
    fn test_field_pEngineName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pEngineName) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(pEngineName)
            )
        );
    }
    test_field_pEngineName();
    fn test_field_engineVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).engineVersion) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(engineVersion)
            )
        );
    }
    test_field_engineVersion();
    fn test_field_apiVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkApplicationInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).apiVersion) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VkApplicationInfo),
                "::",
                stringify!(apiVersion)
            )
        );
    }
    test_field_apiVersion();
}
impl Default for VkApplicationInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkFormatProperties {
    pub linearTilingFeatures: VkFormatFeatureFlags,
    pub optimalTilingFeatures: VkFormatFeatureFlags,
    pub bufferFeatures: VkFormatFeatureFlags,
}
#[test]
fn bindgen_test_layout_VkFormatProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkFormatProperties>(),
        12usize,
        concat!("Size of: ", stringify!(VkFormatProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkFormatProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(VkFormatProperties))
    );
    fn test_field_linearTilingFeatures() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).linearTilingFeatures) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFormatProperties),
                "::",
                stringify!(linearTilingFeatures)
            )
        );
    }
    test_field_linearTilingFeatures();
    fn test_field_optimalTilingFeatures() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).optimalTilingFeatures) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFormatProperties),
                "::",
                stringify!(optimalTilingFeatures)
            )
        );
    }
    test_field_optimalTilingFeatures();
    fn test_field_bufferFeatures() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bufferFeatures) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFormatProperties),
                "::",
                stringify!(bufferFeatures)
            )
        );
    }
    test_field_bufferFeatures();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkImageFormatProperties {
    pub maxExtent: VkExtent3D,
    pub maxMipLevels: u32,
    pub maxArrayLayers: u32,
    pub sampleCounts: VkSampleCountFlags,
    pub maxResourceSize: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkImageFormatProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkImageFormatProperties>(),
        32usize,
        concat!("Size of: ", stringify!(VkImageFormatProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageFormatProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(VkImageFormatProperties))
    );
    fn test_field_maxExtent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxExtent) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageFormatProperties),
                "::",
                stringify!(maxExtent)
            )
        );
    }
    test_field_maxExtent();
    fn test_field_maxMipLevels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxMipLevels) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageFormatProperties),
                "::",
                stringify!(maxMipLevels)
            )
        );
    }
    test_field_maxMipLevels();
    fn test_field_maxArrayLayers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxArrayLayers) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageFormatProperties),
                "::",
                stringify!(maxArrayLayers)
            )
        );
    }
    test_field_maxArrayLayers();
    fn test_field_sampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleCounts) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageFormatProperties),
                "::",
                stringify!(sampleCounts)
            )
        );
    }
    test_field_sampleCounts();
    fn test_field_maxResourceSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxResourceSize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageFormatProperties),
                "::",
                stringify!(maxResourceSize)
            )
        );
    }
    test_field_maxResourceSize();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkInstanceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkInstanceCreateFlags,
    pub pApplicationInfo: *const VkApplicationInfo,
    pub enabledLayerCount: u32,
    pub ppEnabledLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub ppEnabledExtensionNames: *const *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_VkInstanceCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkInstanceCreateInfo>(),
        64usize,
        concat!("Size of: ", stringify!(VkInstanceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkInstanceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkInstanceCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_pApplicationInfo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pApplicationInfo) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(pApplicationInfo)
            )
        );
    }
    test_field_pApplicationInfo();
    fn test_field_enabledLayerCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enabledLayerCount) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(enabledLayerCount)
            )
        );
    }
    test_field_enabledLayerCount();
    fn test_field_ppEnabledLayerNames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ppEnabledLayerNames) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(ppEnabledLayerNames)
            )
        );
    }
    test_field_ppEnabledLayerNames();
    fn test_field_enabledExtensionCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enabledExtensionCount) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(enabledExtensionCount)
            )
        );
    }
    test_field_enabledExtensionCount();
    fn test_field_ppEnabledExtensionNames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkInstanceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ppEnabledExtensionNames) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkInstanceCreateInfo),
                "::",
                stringify!(ppEnabledExtensionNames)
            )
        );
    }
    test_field_ppEnabledExtensionNames();
}
impl Default for VkInstanceCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkMemoryHeap {
    pub size: VkDeviceSize,
    pub flags: VkMemoryHeapFlags,
}
#[test]
fn bindgen_test_layout_VkMemoryHeap() {
    assert_eq!(
        ::std::mem::size_of::<VkMemoryHeap>(),
        16usize,
        concat!("Size of: ", stringify!(VkMemoryHeap))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMemoryHeap>(),
        8usize,
        concat!("Alignment of ", stringify!(VkMemoryHeap))
    );
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryHeap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryHeap),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryHeap>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryHeap),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkMemoryType {
    pub propertyFlags: VkMemoryPropertyFlags,
    pub heapIndex: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryType() {
    assert_eq!(
        ::std::mem::size_of::<VkMemoryType>(),
        8usize,
        concat!("Size of: ", stringify!(VkMemoryType))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMemoryType>(),
        4usize,
        concat!("Alignment of ", stringify!(VkMemoryType))
    );
    fn test_field_propertyFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryType>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).propertyFlags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryType),
                "::",
                stringify!(propertyFlags)
            )
        );
    }
    test_field_propertyFlags();
    fn test_field_heapIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryType>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).heapIndex) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryType),
                "::",
                stringify!(heapIndex)
            )
        );
    }
    test_field_heapIndex();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkPhysicalDeviceFeatures {
    pub robustBufferAccess: VkBool32,
    pub fullDrawIndexUint32: VkBool32,
    pub imageCubeArray: VkBool32,
    pub independentBlend: VkBool32,
    pub geometryShader: VkBool32,
    pub tessellationShader: VkBool32,
    pub sampleRateShading: VkBool32,
    pub dualSrcBlend: VkBool32,
    pub logicOp: VkBool32,
    pub multiDrawIndirect: VkBool32,
    pub drawIndirectFirstInstance: VkBool32,
    pub depthClamp: VkBool32,
    pub depthBiasClamp: VkBool32,
    pub fillModeNonSolid: VkBool32,
    pub depthBounds: VkBool32,
    pub wideLines: VkBool32,
    pub largePoints: VkBool32,
    pub alphaToOne: VkBool32,
    pub multiViewport: VkBool32,
    pub samplerAnisotropy: VkBool32,
    pub textureCompressionETC2: VkBool32,
    pub textureCompressionASTC_LDR: VkBool32,
    pub textureCompressionBC: VkBool32,
    pub occlusionQueryPrecise: VkBool32,
    pub pipelineStatisticsQuery: VkBool32,
    pub vertexPipelineStoresAndAtomics: VkBool32,
    pub fragmentStoresAndAtomics: VkBool32,
    pub shaderTessellationAndGeometryPointSize: VkBool32,
    pub shaderImageGatherExtended: VkBool32,
    pub shaderStorageImageExtendedFormats: VkBool32,
    pub shaderStorageImageMultisample: VkBool32,
    pub shaderStorageImageReadWithoutFormat: VkBool32,
    pub shaderStorageImageWriteWithoutFormat: VkBool32,
    pub shaderUniformBufferArrayDynamicIndexing: VkBool32,
    pub shaderSampledImageArrayDynamicIndexing: VkBool32,
    pub shaderStorageBufferArrayDynamicIndexing: VkBool32,
    pub shaderStorageImageArrayDynamicIndexing: VkBool32,
    pub shaderClipDistance: VkBool32,
    pub shaderCullDistance: VkBool32,
    pub shaderFloat64: VkBool32,
    pub shaderInt64: VkBool32,
    pub shaderInt16: VkBool32,
    pub shaderResourceResidency: VkBool32,
    pub shaderResourceMinLod: VkBool32,
    pub sparseBinding: VkBool32,
    pub sparseResidencyBuffer: VkBool32,
    pub sparseResidencyImage2D: VkBool32,
    pub sparseResidencyImage3D: VkBool32,
    pub sparseResidency2Samples: VkBool32,
    pub sparseResidency4Samples: VkBool32,
    pub sparseResidency8Samples: VkBool32,
    pub sparseResidency16Samples: VkBool32,
    pub sparseResidencyAliased: VkBool32,
    pub variableMultisampleRate: VkBool32,
    pub inheritedQueries: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceFeatures() {
    assert_eq!(
        ::std::mem::size_of::<VkPhysicalDeviceFeatures>(),
        220usize,
        concat!("Size of: ", stringify!(VkPhysicalDeviceFeatures))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPhysicalDeviceFeatures>(),
        4usize,
        concat!("Alignment of ", stringify!(VkPhysicalDeviceFeatures))
    );
    fn test_field_robustBufferAccess() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).robustBufferAccess) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(robustBufferAccess)
            )
        );
    }
    test_field_robustBufferAccess();
    fn test_field_fullDrawIndexUint32() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fullDrawIndexUint32) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(fullDrawIndexUint32)
            )
        );
    }
    test_field_fullDrawIndexUint32();
    fn test_field_imageCubeArray() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageCubeArray) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(imageCubeArray)
            )
        );
    }
    test_field_imageCubeArray();
    fn test_field_independentBlend() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).independentBlend) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(independentBlend)
            )
        );
    }
    test_field_independentBlend();
    fn test_field_geometryShader() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).geometryShader) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(geometryShader)
            )
        );
    }
    test_field_geometryShader();
    fn test_field_tessellationShader() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tessellationShader) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(tessellationShader)
            )
        );
    }
    test_field_tessellationShader();
    fn test_field_sampleRateShading() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampleRateShading) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sampleRateShading)
            )
        );
    }
    test_field_sampleRateShading();
    fn test_field_dualSrcBlend() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).dualSrcBlend) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(dualSrcBlend)
            )
        );
    }
    test_field_dualSrcBlend();
    fn test_field_logicOp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).logicOp) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(logicOp)
            )
        );
    }
    test_field_logicOp();
    fn test_field_multiDrawIndirect() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).multiDrawIndirect) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(multiDrawIndirect)
            )
        );
    }
    test_field_multiDrawIndirect();
    fn test_field_drawIndirectFirstInstance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).drawIndirectFirstInstance) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(drawIndirectFirstInstance)
            )
        );
    }
    test_field_drawIndirectFirstInstance();
    fn test_field_depthClamp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depthClamp) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(depthClamp)
            )
        );
    }
    test_field_depthClamp();
    fn test_field_depthBiasClamp() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depthBiasClamp) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(depthBiasClamp)
            )
        );
    }
    test_field_depthBiasClamp();
    fn test_field_fillModeNonSolid() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fillModeNonSolid) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(fillModeNonSolid)
            )
        );
    }
    test_field_fillModeNonSolid();
    fn test_field_depthBounds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depthBounds) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(depthBounds)
            )
        );
    }
    test_field_depthBounds();
    fn test_field_wideLines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).wideLines) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(wideLines)
            )
        );
    }
    test_field_wideLines();
    fn test_field_largePoints() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).largePoints) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(largePoints)
            )
        );
    }
    test_field_largePoints();
    fn test_field_alphaToOne() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alphaToOne) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(alphaToOne)
            )
        );
    }
    test_field_alphaToOne();
    fn test_field_multiViewport() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).multiViewport) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(multiViewport)
            )
        );
    }
    test_field_multiViewport();
    fn test_field_samplerAnisotropy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).samplerAnisotropy) as usize - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(samplerAnisotropy)
            )
        );
    }
    test_field_samplerAnisotropy();
    fn test_field_textureCompressionETC2() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).textureCompressionETC2) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(textureCompressionETC2)
            )
        );
    }
    test_field_textureCompressionETC2();
    fn test_field_textureCompressionASTC_LDR() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).textureCompressionASTC_LDR) as usize - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(textureCompressionASTC_LDR)
            )
        );
    }
    test_field_textureCompressionASTC_LDR();
    fn test_field_textureCompressionBC() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).textureCompressionBC) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(textureCompressionBC)
            )
        );
    }
    test_field_textureCompressionBC();
    fn test_field_occlusionQueryPrecise() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).occlusionQueryPrecise) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(occlusionQueryPrecise)
            )
        );
    }
    test_field_occlusionQueryPrecise();
    fn test_field_pipelineStatisticsQuery() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pipelineStatisticsQuery) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(pipelineStatisticsQuery)
            )
        );
    }
    test_field_pipelineStatisticsQuery();
    fn test_field_vertexPipelineStoresAndAtomics() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vertexPipelineStoresAndAtomics) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(vertexPipelineStoresAndAtomics)
            )
        );
    }
    test_field_vertexPipelineStoresAndAtomics();
    fn test_field_fragmentStoresAndAtomics() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fragmentStoresAndAtomics) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(fragmentStoresAndAtomics)
            )
        );
    }
    test_field_fragmentStoresAndAtomics();
    fn test_field_shaderTessellationAndGeometryPointSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderTessellationAndGeometryPointSize) as usize
                    - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderTessellationAndGeometryPointSize)
            )
        );
    }
    test_field_shaderTessellationAndGeometryPointSize();
    fn test_field_shaderImageGatherExtended() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderImageGatherExtended) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderImageGatherExtended)
            )
        );
    }
    test_field_shaderImageGatherExtended();
    fn test_field_shaderStorageImageExtendedFormats() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageImageExtendedFormats) as usize
                    - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageImageExtendedFormats)
            )
        );
    }
    test_field_shaderStorageImageExtendedFormats();
    fn test_field_shaderStorageImageMultisample() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageImageMultisample) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageImageMultisample)
            )
        );
    }
    test_field_shaderStorageImageMultisample();
    fn test_field_shaderStorageImageReadWithoutFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageImageReadWithoutFormat) as usize
                    - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageImageReadWithoutFormat)
            )
        );
    }
    test_field_shaderStorageImageReadWithoutFormat();
    fn test_field_shaderStorageImageWriteWithoutFormat() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageImageWriteWithoutFormat) as usize
                    - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageImageWriteWithoutFormat)
            )
        );
    }
    test_field_shaderStorageImageWriteWithoutFormat();
    fn test_field_shaderUniformBufferArrayDynamicIndexing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderUniformBufferArrayDynamicIndexing) as usize
                    - ptr as usize
            },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderUniformBufferArrayDynamicIndexing)
            )
        );
    }
    test_field_shaderUniformBufferArrayDynamicIndexing();
    fn test_field_shaderSampledImageArrayDynamicIndexing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderSampledImageArrayDynamicIndexing) as usize
                    - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderSampledImageArrayDynamicIndexing)
            )
        );
    }
    test_field_shaderSampledImageArrayDynamicIndexing();
    fn test_field_shaderStorageBufferArrayDynamicIndexing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageBufferArrayDynamicIndexing) as usize
                    - ptr as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageBufferArrayDynamicIndexing)
            )
        );
    }
    test_field_shaderStorageBufferArrayDynamicIndexing();
    fn test_field_shaderStorageImageArrayDynamicIndexing() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderStorageImageArrayDynamicIndexing) as usize
                    - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderStorageImageArrayDynamicIndexing)
            )
        );
    }
    test_field_shaderStorageImageArrayDynamicIndexing();
    fn test_field_shaderClipDistance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderClipDistance) as usize - ptr as usize
            },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderClipDistance)
            )
        );
    }
    test_field_shaderClipDistance();
    fn test_field_shaderCullDistance() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderCullDistance) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderCullDistance)
            )
        );
    }
    test_field_shaderCullDistance();
    fn test_field_shaderFloat64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderFloat64) as usize - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderFloat64)
            )
        );
    }
    test_field_shaderFloat64();
    fn test_field_shaderInt64() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderInt64) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderInt64)
            )
        );
    }
    test_field_shaderInt64();
    fn test_field_shaderInt16() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderInt16) as usize - ptr as usize
            },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderInt16)
            )
        );
    }
    test_field_shaderInt16();
    fn test_field_shaderResourceResidency() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderResourceResidency) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderResourceResidency)
            )
        );
    }
    test_field_shaderResourceResidency();
    fn test_field_shaderResourceMinLod() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).shaderResourceMinLod) as usize - ptr as usize
            },
            172usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(shaderResourceMinLod)
            )
        );
    }
    test_field_shaderResourceMinLod();
    fn test_field_sparseBinding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseBinding) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseBinding)
            )
        );
    }
    test_field_sparseBinding();
    fn test_field_sparseResidencyBuffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidencyBuffer) as usize - ptr as usize
            },
            180usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidencyBuffer)
            )
        );
    }
    test_field_sparseResidencyBuffer();
    fn test_field_sparseResidencyImage2D() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidencyImage2D) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidencyImage2D)
            )
        );
    }
    test_field_sparseResidencyImage2D();
    fn test_field_sparseResidencyImage3D() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidencyImage3D) as usize - ptr as usize
            },
            188usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidencyImage3D)
            )
        );
    }
    test_field_sparseResidencyImage3D();
    fn test_field_sparseResidency2Samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidency2Samples) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidency2Samples)
            )
        );
    }
    test_field_sparseResidency2Samples();
    fn test_field_sparseResidency4Samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidency4Samples) as usize - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidency4Samples)
            )
        );
    }
    test_field_sparseResidency4Samples();
    fn test_field_sparseResidency8Samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidency8Samples) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidency8Samples)
            )
        );
    }
    test_field_sparseResidency8Samples();
    fn test_field_sparseResidency16Samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidency16Samples) as usize - ptr as usize
            },
            204usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidency16Samples)
            )
        );
    }
    test_field_sparseResidency16Samples();
    fn test_field_sparseResidencyAliased() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseResidencyAliased) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(sparseResidencyAliased)
            )
        );
    }
    test_field_sparseResidencyAliased();
    fn test_field_variableMultisampleRate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).variableMultisampleRate) as usize - ptr as usize
            },
            212usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(variableMultisampleRate)
            )
        );
    }
    test_field_variableMultisampleRate();
    fn test_field_inheritedQueries() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceFeatures>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).inheritedQueries) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceFeatures),
                "::",
                stringify!(inheritedQueries)
            )
        );
    }
    test_field_inheritedQueries();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkPhysicalDeviceLimits {
    pub maxImageDimension1D: u32,
    pub maxImageDimension2D: u32,
    pub maxImageDimension3D: u32,
    pub maxImageDimensionCube: u32,
    pub maxImageArrayLayers: u32,
    pub maxTexelBufferElements: u32,
    pub maxUniformBufferRange: u32,
    pub maxStorageBufferRange: u32,
    pub maxPushConstantsSize: u32,
    pub maxMemoryAllocationCount: u32,
    pub maxSamplerAllocationCount: u32,
    pub bufferImageGranularity: VkDeviceSize,
    pub sparseAddressSpaceSize: VkDeviceSize,
    pub maxBoundDescriptorSets: u32,
    pub maxPerStageDescriptorSamplers: u32,
    pub maxPerStageDescriptorUniformBuffers: u32,
    pub maxPerStageDescriptorStorageBuffers: u32,
    pub maxPerStageDescriptorSampledImages: u32,
    pub maxPerStageDescriptorStorageImages: u32,
    pub maxPerStageDescriptorInputAttachments: u32,
    pub maxPerStageResources: u32,
    pub maxDescriptorSetSamplers: u32,
    pub maxDescriptorSetUniformBuffers: u32,
    pub maxDescriptorSetUniformBuffersDynamic: u32,
    pub maxDescriptorSetStorageBuffers: u32,
    pub maxDescriptorSetStorageBuffersDynamic: u32,
    pub maxDescriptorSetSampledImages: u32,
    pub maxDescriptorSetStorageImages: u32,
    pub maxDescriptorSetInputAttachments: u32,
    pub maxVertexInputAttributes: u32,
    pub maxVertexInputBindings: u32,
    pub maxVertexInputAttributeOffset: u32,
    pub maxVertexInputBindingStride: u32,
    pub maxVertexOutputComponents: u32,
    pub maxTessellationGenerationLevel: u32,
    pub maxTessellationPatchSize: u32,
    pub maxTessellationControlPerVertexInputComponents: u32,
    pub maxTessellationControlPerVertexOutputComponents: u32,
    pub maxTessellationControlPerPatchOutputComponents: u32,
    pub maxTessellationControlTotalOutputComponents: u32,
    pub maxTessellationEvaluationInputComponents: u32,
    pub maxTessellationEvaluationOutputComponents: u32,
    pub maxGeometryShaderInvocations: u32,
    pub maxGeometryInputComponents: u32,
    pub maxGeometryOutputComponents: u32,
    pub maxGeometryOutputVertices: u32,
    pub maxGeometryTotalOutputComponents: u32,
    pub maxFragmentInputComponents: u32,
    pub maxFragmentOutputAttachments: u32,
    pub maxFragmentDualSrcAttachments: u32,
    pub maxFragmentCombinedOutputResources: u32,
    pub maxComputeSharedMemorySize: u32,
    pub maxComputeWorkGroupCount: [u32; 3usize],
    pub maxComputeWorkGroupInvocations: u32,
    pub maxComputeWorkGroupSize: [u32; 3usize],
    pub subPixelPrecisionBits: u32,
    pub subTexelPrecisionBits: u32,
    pub mipmapPrecisionBits: u32,
    pub maxDrawIndexedIndexValue: u32,
    pub maxDrawIndirectCount: u32,
    pub maxSamplerLodBias: f32,
    pub maxSamplerAnisotropy: f32,
    pub maxViewports: u32,
    pub maxViewportDimensions: [u32; 2usize],
    pub viewportBoundsRange: [f32; 2usize],
    pub viewportSubPixelBits: u32,
    pub minMemoryMapAlignment: usize,
    pub minTexelBufferOffsetAlignment: VkDeviceSize,
    pub minUniformBufferOffsetAlignment: VkDeviceSize,
    pub minStorageBufferOffsetAlignment: VkDeviceSize,
    pub minTexelOffset: i32,
    pub maxTexelOffset: u32,
    pub minTexelGatherOffset: i32,
    pub maxTexelGatherOffset: u32,
    pub minInterpolationOffset: f32,
    pub maxInterpolationOffset: f32,
    pub subPixelInterpolationOffsetBits: u32,
    pub maxFramebufferWidth: u32,
    pub maxFramebufferHeight: u32,
    pub maxFramebufferLayers: u32,
    pub framebufferColorSampleCounts: VkSampleCountFlags,
    pub framebufferDepthSampleCounts: VkSampleCountFlags,
    pub framebufferStencilSampleCounts: VkSampleCountFlags,
    pub framebufferNoAttachmentsSampleCounts: VkSampleCountFlags,
    pub maxColorAttachments: u32,
    pub sampledImageColorSampleCounts: VkSampleCountFlags,
    pub sampledImageIntegerSampleCounts: VkSampleCountFlags,
    pub sampledImageDepthSampleCounts: VkSampleCountFlags,
    pub sampledImageStencilSampleCounts: VkSampleCountFlags,
    pub storageImageSampleCounts: VkSampleCountFlags,
    pub maxSampleMaskWords: u32,
    pub timestampComputeAndGraphics: VkBool32,
    pub timestampPeriod: f32,
    pub maxClipDistances: u32,
    pub maxCullDistances: u32,
    pub maxCombinedClipAndCullDistances: u32,
    pub discreteQueuePriorities: u32,
    pub pointSizeRange: [f32; 2usize],
    pub lineWidthRange: [f32; 2usize],
    pub pointSizeGranularity: f32,
    pub lineWidthGranularity: f32,
    pub strictLines: VkBool32,
    pub standardSampleLocations: VkBool32,
    pub optimalBufferCopyOffsetAlignment: VkDeviceSize,
    pub optimalBufferCopyRowPitchAlignment: VkDeviceSize,
    pub nonCoherentAtomSize: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceLimits() {
    assert_eq!(
        ::std::mem::size_of::<VkPhysicalDeviceLimits>(),
        504usize,
        concat!("Size of: ", stringify!(VkPhysicalDeviceLimits))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPhysicalDeviceLimits>(),
        8usize,
        concat!("Alignment of ", stringify!(VkPhysicalDeviceLimits))
    );
    fn test_field_maxImageDimension1D() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxImageDimension1D) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxImageDimension1D)
            )
        );
    }
    test_field_maxImageDimension1D();
    fn test_field_maxImageDimension2D() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxImageDimension2D) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxImageDimension2D)
            )
        );
    }
    test_field_maxImageDimension2D();
    fn test_field_maxImageDimension3D() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxImageDimension3D) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxImageDimension3D)
            )
        );
    }
    test_field_maxImageDimension3D();
    fn test_field_maxImageDimensionCube() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxImageDimensionCube) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxImageDimensionCube)
            )
        );
    }
    test_field_maxImageDimensionCube();
    fn test_field_maxImageArrayLayers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxImageArrayLayers) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxImageArrayLayers)
            )
        );
    }
    test_field_maxImageArrayLayers();
    fn test_field_maxTexelBufferElements() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTexelBufferElements) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTexelBufferElements)
            )
        );
    }
    test_field_maxTexelBufferElements();
    fn test_field_maxUniformBufferRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxUniformBufferRange) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxUniformBufferRange)
            )
        );
    }
    test_field_maxUniformBufferRange();
    fn test_field_maxStorageBufferRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxStorageBufferRange) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxStorageBufferRange)
            )
        );
    }
    test_field_maxStorageBufferRange();
    fn test_field_maxPushConstantsSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPushConstantsSize) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPushConstantsSize)
            )
        );
    }
    test_field_maxPushConstantsSize();
    fn test_field_maxMemoryAllocationCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxMemoryAllocationCount) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxMemoryAllocationCount)
            )
        );
    }
    test_field_maxMemoryAllocationCount();
    fn test_field_maxSamplerAllocationCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxSamplerAllocationCount) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxSamplerAllocationCount)
            )
        );
    }
    test_field_maxSamplerAllocationCount();
    fn test_field_bufferImageGranularity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bufferImageGranularity) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(bufferImageGranularity)
            )
        );
    }
    test_field_bufferImageGranularity();
    fn test_field_sparseAddressSpaceSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseAddressSpaceSize) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(sparseAddressSpaceSize)
            )
        );
    }
    test_field_sparseAddressSpaceSize();
    fn test_field_maxBoundDescriptorSets() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxBoundDescriptorSets) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxBoundDescriptorSets)
            )
        );
    }
    test_field_maxBoundDescriptorSets();
    fn test_field_maxPerStageDescriptorSamplers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorSamplers) as usize - ptr as usize
            },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorSamplers)
            )
        );
    }
    test_field_maxPerStageDescriptorSamplers();
    fn test_field_maxPerStageDescriptorUniformBuffers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorUniformBuffers) as usize
                    - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorUniformBuffers)
            )
        );
    }
    test_field_maxPerStageDescriptorUniformBuffers();
    fn test_field_maxPerStageDescriptorStorageBuffers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorStorageBuffers) as usize
                    - ptr as usize
            },
            76usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorStorageBuffers)
            )
        );
    }
    test_field_maxPerStageDescriptorStorageBuffers();
    fn test_field_maxPerStageDescriptorSampledImages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorSampledImages) as usize
                    - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorSampledImages)
            )
        );
    }
    test_field_maxPerStageDescriptorSampledImages();
    fn test_field_maxPerStageDescriptorStorageImages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorStorageImages) as usize
                    - ptr as usize
            },
            84usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorStorageImages)
            )
        );
    }
    test_field_maxPerStageDescriptorStorageImages();
    fn test_field_maxPerStageDescriptorInputAttachments() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageDescriptorInputAttachments) as usize
                    - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageDescriptorInputAttachments)
            )
        );
    }
    test_field_maxPerStageDescriptorInputAttachments();
    fn test_field_maxPerStageResources() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxPerStageResources) as usize - ptr as usize
            },
            92usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxPerStageResources)
            )
        );
    }
    test_field_maxPerStageResources();
    fn test_field_maxDescriptorSetSamplers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetSamplers) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetSamplers)
            )
        );
    }
    test_field_maxDescriptorSetSamplers();
    fn test_field_maxDescriptorSetUniformBuffers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetUniformBuffers) as usize - ptr as usize
            },
            100usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetUniformBuffers)
            )
        );
    }
    test_field_maxDescriptorSetUniformBuffers();
    fn test_field_maxDescriptorSetUniformBuffersDynamic() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetUniformBuffersDynamic) as usize
                    - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetUniformBuffersDynamic)
            )
        );
    }
    test_field_maxDescriptorSetUniformBuffersDynamic();
    fn test_field_maxDescriptorSetStorageBuffers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetStorageBuffers) as usize - ptr as usize
            },
            108usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetStorageBuffers)
            )
        );
    }
    test_field_maxDescriptorSetStorageBuffers();
    fn test_field_maxDescriptorSetStorageBuffersDynamic() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetStorageBuffersDynamic) as usize
                    - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetStorageBuffersDynamic)
            )
        );
    }
    test_field_maxDescriptorSetStorageBuffersDynamic();
    fn test_field_maxDescriptorSetSampledImages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetSampledImages) as usize - ptr as usize
            },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetSampledImages)
            )
        );
    }
    test_field_maxDescriptorSetSampledImages();
    fn test_field_maxDescriptorSetStorageImages() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetStorageImages) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetStorageImages)
            )
        );
    }
    test_field_maxDescriptorSetStorageImages();
    fn test_field_maxDescriptorSetInputAttachments() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDescriptorSetInputAttachments) as usize
                    - ptr as usize
            },
            124usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDescriptorSetInputAttachments)
            )
        );
    }
    test_field_maxDescriptorSetInputAttachments();
    fn test_field_maxVertexInputAttributes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVertexInputAttributes) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxVertexInputAttributes)
            )
        );
    }
    test_field_maxVertexInputAttributes();
    fn test_field_maxVertexInputBindings() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVertexInputBindings) as usize - ptr as usize
            },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxVertexInputBindings)
            )
        );
    }
    test_field_maxVertexInputBindings();
    fn test_field_maxVertexInputAttributeOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVertexInputAttributeOffset) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxVertexInputAttributeOffset)
            )
        );
    }
    test_field_maxVertexInputAttributeOffset();
    fn test_field_maxVertexInputBindingStride() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVertexInputBindingStride) as usize - ptr as usize
            },
            140usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxVertexInputBindingStride)
            )
        );
    }
    test_field_maxVertexInputBindingStride();
    fn test_field_maxVertexOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxVertexOutputComponents) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxVertexOutputComponents)
            )
        );
    }
    test_field_maxVertexOutputComponents();
    fn test_field_maxTessellationGenerationLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationGenerationLevel) as usize - ptr as usize
            },
            148usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationGenerationLevel)
            )
        );
    }
    test_field_maxTessellationGenerationLevel();
    fn test_field_maxTessellationPatchSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationPatchSize) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationPatchSize)
            )
        );
    }
    test_field_maxTessellationPatchSize();
    fn test_field_maxTessellationControlPerVertexInputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationControlPerVertexInputComponents) as usize
                    - ptr as usize
            },
            156usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationControlPerVertexInputComponents)
            )
        );
    }
    test_field_maxTessellationControlPerVertexInputComponents();
    fn test_field_maxTessellationControlPerVertexOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationControlPerVertexOutputComponents)
                    as usize
                    - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationControlPerVertexOutputComponents)
            )
        );
    }
    test_field_maxTessellationControlPerVertexOutputComponents();
    fn test_field_maxTessellationControlPerPatchOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationControlPerPatchOutputComponents) as usize
                    - ptr as usize
            },
            164usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationControlPerPatchOutputComponents)
            )
        );
    }
    test_field_maxTessellationControlPerPatchOutputComponents();
    fn test_field_maxTessellationControlTotalOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationControlTotalOutputComponents) as usize
                    - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationControlTotalOutputComponents)
            )
        );
    }
    test_field_maxTessellationControlTotalOutputComponents();
    fn test_field_maxTessellationEvaluationInputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationEvaluationInputComponents) as usize
                    - ptr as usize
            },
            172usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationEvaluationInputComponents)
            )
        );
    }
    test_field_maxTessellationEvaluationInputComponents();
    fn test_field_maxTessellationEvaluationOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTessellationEvaluationOutputComponents) as usize
                    - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTessellationEvaluationOutputComponents)
            )
        );
    }
    test_field_maxTessellationEvaluationOutputComponents();
    fn test_field_maxGeometryShaderInvocations() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxGeometryShaderInvocations) as usize - ptr as usize
            },
            180usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxGeometryShaderInvocations)
            )
        );
    }
    test_field_maxGeometryShaderInvocations();
    fn test_field_maxGeometryInputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxGeometryInputComponents) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxGeometryInputComponents)
            )
        );
    }
    test_field_maxGeometryInputComponents();
    fn test_field_maxGeometryOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxGeometryOutputComponents) as usize - ptr as usize
            },
            188usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxGeometryOutputComponents)
            )
        );
    }
    test_field_maxGeometryOutputComponents();
    fn test_field_maxGeometryOutputVertices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxGeometryOutputVertices) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxGeometryOutputVertices)
            )
        );
    }
    test_field_maxGeometryOutputVertices();
    fn test_field_maxGeometryTotalOutputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxGeometryTotalOutputComponents) as usize
                    - ptr as usize
            },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxGeometryTotalOutputComponents)
            )
        );
    }
    test_field_maxGeometryTotalOutputComponents();
    fn test_field_maxFragmentInputComponents() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFragmentInputComponents) as usize - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFragmentInputComponents)
            )
        );
    }
    test_field_maxFragmentInputComponents();
    fn test_field_maxFragmentOutputAttachments() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFragmentOutputAttachments) as usize - ptr as usize
            },
            204usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFragmentOutputAttachments)
            )
        );
    }
    test_field_maxFragmentOutputAttachments();
    fn test_field_maxFragmentDualSrcAttachments() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFragmentDualSrcAttachments) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFragmentDualSrcAttachments)
            )
        );
    }
    test_field_maxFragmentDualSrcAttachments();
    fn test_field_maxFragmentCombinedOutputResources() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFragmentCombinedOutputResources) as usize
                    - ptr as usize
            },
            212usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFragmentCombinedOutputResources)
            )
        );
    }
    test_field_maxFragmentCombinedOutputResources();
    fn test_field_maxComputeSharedMemorySize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxComputeSharedMemorySize) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxComputeSharedMemorySize)
            )
        );
    }
    test_field_maxComputeSharedMemorySize();
    fn test_field_maxComputeWorkGroupCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxComputeWorkGroupCount) as usize - ptr as usize
            },
            220usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxComputeWorkGroupCount)
            )
        );
    }
    test_field_maxComputeWorkGroupCount();
    fn test_field_maxComputeWorkGroupInvocations() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxComputeWorkGroupInvocations) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxComputeWorkGroupInvocations)
            )
        );
    }
    test_field_maxComputeWorkGroupInvocations();
    fn test_field_maxComputeWorkGroupSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxComputeWorkGroupSize) as usize - ptr as usize
            },
            236usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxComputeWorkGroupSize)
            )
        );
    }
    test_field_maxComputeWorkGroupSize();
    fn test_field_subPixelPrecisionBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subPixelPrecisionBits) as usize - ptr as usize
            },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(subPixelPrecisionBits)
            )
        );
    }
    test_field_subPixelPrecisionBits();
    fn test_field_subTexelPrecisionBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subTexelPrecisionBits) as usize - ptr as usize
            },
            252usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(subTexelPrecisionBits)
            )
        );
    }
    test_field_subTexelPrecisionBits();
    fn test_field_mipmapPrecisionBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mipmapPrecisionBits) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(mipmapPrecisionBits)
            )
        );
    }
    test_field_mipmapPrecisionBits();
    fn test_field_maxDrawIndexedIndexValue() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDrawIndexedIndexValue) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDrawIndexedIndexValue)
            )
        );
    }
    test_field_maxDrawIndexedIndexValue();
    fn test_field_maxDrawIndirectCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxDrawIndirectCount) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxDrawIndirectCount)
            )
        );
    }
    test_field_maxDrawIndirectCount();
    fn test_field_maxSamplerLodBias() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxSamplerLodBias) as usize - ptr as usize
            },
            268usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxSamplerLodBias)
            )
        );
    }
    test_field_maxSamplerLodBias();
    fn test_field_maxSamplerAnisotropy() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxSamplerAnisotropy) as usize - ptr as usize
            },
            272usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxSamplerAnisotropy)
            )
        );
    }
    test_field_maxSamplerAnisotropy();
    fn test_field_maxViewports() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxViewports) as usize - ptr as usize
            },
            276usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxViewports)
            )
        );
    }
    test_field_maxViewports();
    fn test_field_maxViewportDimensions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxViewportDimensions) as usize - ptr as usize
            },
            280usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxViewportDimensions)
            )
        );
    }
    test_field_maxViewportDimensions();
    fn test_field_viewportBoundsRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).viewportBoundsRange) as usize - ptr as usize
            },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(viewportBoundsRange)
            )
        );
    }
    test_field_viewportBoundsRange();
    fn test_field_viewportSubPixelBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).viewportSubPixelBits) as usize - ptr as usize
            },
            296usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(viewportSubPixelBits)
            )
        );
    }
    test_field_viewportSubPixelBits();
    fn test_field_minMemoryMapAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minMemoryMapAlignment) as usize - ptr as usize
            },
            304usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minMemoryMapAlignment)
            )
        );
    }
    test_field_minMemoryMapAlignment();
    fn test_field_minTexelBufferOffsetAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minTexelBufferOffsetAlignment) as usize - ptr as usize
            },
            312usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minTexelBufferOffsetAlignment)
            )
        );
    }
    test_field_minTexelBufferOffsetAlignment();
    fn test_field_minUniformBufferOffsetAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minUniformBufferOffsetAlignment) as usize - ptr as usize
            },
            320usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minUniformBufferOffsetAlignment)
            )
        );
    }
    test_field_minUniformBufferOffsetAlignment();
    fn test_field_minStorageBufferOffsetAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minStorageBufferOffsetAlignment) as usize - ptr as usize
            },
            328usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minStorageBufferOffsetAlignment)
            )
        );
    }
    test_field_minStorageBufferOffsetAlignment();
    fn test_field_minTexelOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minTexelOffset) as usize - ptr as usize
            },
            336usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minTexelOffset)
            )
        );
    }
    test_field_minTexelOffset();
    fn test_field_maxTexelOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTexelOffset) as usize - ptr as usize
            },
            340usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTexelOffset)
            )
        );
    }
    test_field_maxTexelOffset();
    fn test_field_minTexelGatherOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minTexelGatherOffset) as usize - ptr as usize
            },
            344usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minTexelGatherOffset)
            )
        );
    }
    test_field_minTexelGatherOffset();
    fn test_field_maxTexelGatherOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxTexelGatherOffset) as usize - ptr as usize
            },
            348usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxTexelGatherOffset)
            )
        );
    }
    test_field_maxTexelGatherOffset();
    fn test_field_minInterpolationOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minInterpolationOffset) as usize - ptr as usize
            },
            352usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(minInterpolationOffset)
            )
        );
    }
    test_field_minInterpolationOffset();
    fn test_field_maxInterpolationOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxInterpolationOffset) as usize - ptr as usize
            },
            356usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxInterpolationOffset)
            )
        );
    }
    test_field_maxInterpolationOffset();
    fn test_field_subPixelInterpolationOffsetBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subPixelInterpolationOffsetBits) as usize - ptr as usize
            },
            360usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(subPixelInterpolationOffsetBits)
            )
        );
    }
    test_field_subPixelInterpolationOffsetBits();
    fn test_field_maxFramebufferWidth() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFramebufferWidth) as usize - ptr as usize
            },
            364usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFramebufferWidth)
            )
        );
    }
    test_field_maxFramebufferWidth();
    fn test_field_maxFramebufferHeight() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFramebufferHeight) as usize - ptr as usize
            },
            368usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFramebufferHeight)
            )
        );
    }
    test_field_maxFramebufferHeight();
    fn test_field_maxFramebufferLayers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxFramebufferLayers) as usize - ptr as usize
            },
            372usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxFramebufferLayers)
            )
        );
    }
    test_field_maxFramebufferLayers();
    fn test_field_framebufferColorSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).framebufferColorSampleCounts) as usize - ptr as usize
            },
            376usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(framebufferColorSampleCounts)
            )
        );
    }
    test_field_framebufferColorSampleCounts();
    fn test_field_framebufferDepthSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).framebufferDepthSampleCounts) as usize - ptr as usize
            },
            380usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(framebufferDepthSampleCounts)
            )
        );
    }
    test_field_framebufferDepthSampleCounts();
    fn test_field_framebufferStencilSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).framebufferStencilSampleCounts) as usize - ptr as usize
            },
            384usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(framebufferStencilSampleCounts)
            )
        );
    }
    test_field_framebufferStencilSampleCounts();
    fn test_field_framebufferNoAttachmentsSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).framebufferNoAttachmentsSampleCounts) as usize
                    - ptr as usize
            },
            388usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(framebufferNoAttachmentsSampleCounts)
            )
        );
    }
    test_field_framebufferNoAttachmentsSampleCounts();
    fn test_field_maxColorAttachments() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxColorAttachments) as usize - ptr as usize
            },
            392usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxColorAttachments)
            )
        );
    }
    test_field_maxColorAttachments();
    fn test_field_sampledImageColorSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampledImageColorSampleCounts) as usize - ptr as usize
            },
            396usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(sampledImageColorSampleCounts)
            )
        );
    }
    test_field_sampledImageColorSampleCounts();
    fn test_field_sampledImageIntegerSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampledImageIntegerSampleCounts) as usize - ptr as usize
            },
            400usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(sampledImageIntegerSampleCounts)
            )
        );
    }
    test_field_sampledImageIntegerSampleCounts();
    fn test_field_sampledImageDepthSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampledImageDepthSampleCounts) as usize - ptr as usize
            },
            404usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(sampledImageDepthSampleCounts)
            )
        );
    }
    test_field_sampledImageDepthSampleCounts();
    fn test_field_sampledImageStencilSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sampledImageStencilSampleCounts) as usize - ptr as usize
            },
            408usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(sampledImageStencilSampleCounts)
            )
        );
    }
    test_field_sampledImageStencilSampleCounts();
    fn test_field_storageImageSampleCounts() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).storageImageSampleCounts) as usize - ptr as usize
            },
            412usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(storageImageSampleCounts)
            )
        );
    }
    test_field_storageImageSampleCounts();
    fn test_field_maxSampleMaskWords() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxSampleMaskWords) as usize - ptr as usize
            },
            416usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxSampleMaskWords)
            )
        );
    }
    test_field_maxSampleMaskWords();
    fn test_field_timestampComputeAndGraphics() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timestampComputeAndGraphics) as usize - ptr as usize
            },
            420usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(timestampComputeAndGraphics)
            )
        );
    }
    test_field_timestampComputeAndGraphics();
    fn test_field_timestampPeriod() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timestampPeriod) as usize - ptr as usize
            },
            424usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(timestampPeriod)
            )
        );
    }
    test_field_timestampPeriod();
    fn test_field_maxClipDistances() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxClipDistances) as usize - ptr as usize
            },
            428usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxClipDistances)
            )
        );
    }
    test_field_maxClipDistances();
    fn test_field_maxCullDistances() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxCullDistances) as usize - ptr as usize
            },
            432usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxCullDistances)
            )
        );
    }
    test_field_maxCullDistances();
    fn test_field_maxCombinedClipAndCullDistances() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).maxCombinedClipAndCullDistances) as usize - ptr as usize
            },
            436usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(maxCombinedClipAndCullDistances)
            )
        );
    }
    test_field_maxCombinedClipAndCullDistances();
    fn test_field_discreteQueuePriorities() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).discreteQueuePriorities) as usize - ptr as usize
            },
            440usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(discreteQueuePriorities)
            )
        );
    }
    test_field_discreteQueuePriorities();
    fn test_field_pointSizeRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pointSizeRange) as usize - ptr as usize
            },
            444usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(pointSizeRange)
            )
        );
    }
    test_field_pointSizeRange();
    fn test_field_lineWidthRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lineWidthRange) as usize - ptr as usize
            },
            452usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(lineWidthRange)
            )
        );
    }
    test_field_lineWidthRange();
    fn test_field_pointSizeGranularity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pointSizeGranularity) as usize - ptr as usize
            },
            460usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(pointSizeGranularity)
            )
        );
    }
    test_field_pointSizeGranularity();
    fn test_field_lineWidthGranularity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).lineWidthGranularity) as usize - ptr as usize
            },
            464usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(lineWidthGranularity)
            )
        );
    }
    test_field_lineWidthGranularity();
    fn test_field_strictLines() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).strictLines) as usize - ptr as usize
            },
            468usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(strictLines)
            )
        );
    }
    test_field_strictLines();
    fn test_field_standardSampleLocations() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).standardSampleLocations) as usize - ptr as usize
            },
            472usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(standardSampleLocations)
            )
        );
    }
    test_field_standardSampleLocations();
    fn test_field_optimalBufferCopyOffsetAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).optimalBufferCopyOffsetAlignment) as usize
                    - ptr as usize
            },
            480usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(optimalBufferCopyOffsetAlignment)
            )
        );
    }
    test_field_optimalBufferCopyOffsetAlignment();
    fn test_field_optimalBufferCopyRowPitchAlignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).optimalBufferCopyRowPitchAlignment) as usize
                    - ptr as usize
            },
            488usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(optimalBufferCopyRowPitchAlignment)
            )
        );
    }
    test_field_optimalBufferCopyRowPitchAlignment();
    fn test_field_nonCoherentAtomSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceLimits>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).nonCoherentAtomSize) as usize - ptr as usize
            },
            496usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceLimits),
                "::",
                stringify!(nonCoherentAtomSize)
            )
        );
    }
    test_field_nonCoherentAtomSize();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkPhysicalDeviceMemoryProperties {
    pub memoryTypeCount: u32,
    pub memoryTypes: [VkMemoryType; 32usize],
    pub memoryHeapCount: u32,
    pub memoryHeaps: [VkMemoryHeap; 16usize],
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceMemoryProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkPhysicalDeviceMemoryProperties>(),
        520usize,
        concat!("Size of: ", stringify!(VkPhysicalDeviceMemoryProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPhysicalDeviceMemoryProperties>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(VkPhysicalDeviceMemoryProperties)
        )
    );
    fn test_field_memoryTypeCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceMemoryProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryTypeCount) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceMemoryProperties),
                "::",
                stringify!(memoryTypeCount)
            )
        );
    }
    test_field_memoryTypeCount();
    fn test_field_memoryTypes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceMemoryProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryTypes) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceMemoryProperties),
                "::",
                stringify!(memoryTypes)
            )
        );
    }
    test_field_memoryTypes();
    fn test_field_memoryHeapCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceMemoryProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryHeapCount) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceMemoryProperties),
                "::",
                stringify!(memoryHeapCount)
            )
        );
    }
    test_field_memoryHeapCount();
    fn test_field_memoryHeaps() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceMemoryProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryHeaps) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceMemoryProperties),
                "::",
                stringify!(memoryHeaps)
            )
        );
    }
    test_field_memoryHeaps();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkPhysicalDeviceSparseProperties {
    pub residencyStandard2DBlockShape: VkBool32,
    pub residencyStandard2DMultisampleBlockShape: VkBool32,
    pub residencyStandard3DBlockShape: VkBool32,
    pub residencyAlignedMipSize: VkBool32,
    pub residencyNonResidentStrict: VkBool32,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceSparseProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkPhysicalDeviceSparseProperties>(),
        20usize,
        concat!("Size of: ", stringify!(VkPhysicalDeviceSparseProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPhysicalDeviceSparseProperties>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(VkPhysicalDeviceSparseProperties)
        )
    );
    fn test_field_residencyStandard2DBlockShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceSparseProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).residencyStandard2DBlockShape) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceSparseProperties),
                "::",
                stringify!(residencyStandard2DBlockShape)
            )
        );
    }
    test_field_residencyStandard2DBlockShape();
    fn test_field_residencyStandard2DMultisampleBlockShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceSparseProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).residencyStandard2DMultisampleBlockShape) as usize
                    - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceSparseProperties),
                "::",
                stringify!(residencyStandard2DMultisampleBlockShape)
            )
        );
    }
    test_field_residencyStandard2DMultisampleBlockShape();
    fn test_field_residencyStandard3DBlockShape() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceSparseProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).residencyStandard3DBlockShape) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceSparseProperties),
                "::",
                stringify!(residencyStandard3DBlockShape)
            )
        );
    }
    test_field_residencyStandard3DBlockShape();
    fn test_field_residencyAlignedMipSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceSparseProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).residencyAlignedMipSize) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceSparseProperties),
                "::",
                stringify!(residencyAlignedMipSize)
            )
        );
    }
    test_field_residencyAlignedMipSize();
    fn test_field_residencyNonResidentStrict() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceSparseProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).residencyNonResidentStrict) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceSparseProperties),
                "::",
                stringify!(residencyNonResidentStrict)
            )
        );
    }
    test_field_residencyNonResidentStrict();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkPhysicalDeviceProperties {
    pub apiVersion: u32,
    pub driverVersion: u32,
    pub vendorID: u32,
    pub deviceID: u32,
    pub deviceType: VkPhysicalDeviceType,
    pub deviceName: [::std::os::raw::c_char; 256usize],
    pub pipelineCacheUUID: [u8; 16usize],
    pub limits: VkPhysicalDeviceLimits,
    pub sparseProperties: VkPhysicalDeviceSparseProperties,
}
#[test]
fn bindgen_test_layout_VkPhysicalDeviceProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkPhysicalDeviceProperties>(),
        824usize,
        concat!("Size of: ", stringify!(VkPhysicalDeviceProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkPhysicalDeviceProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(VkPhysicalDeviceProperties))
    );
    fn test_field_apiVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).apiVersion) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(apiVersion)
            )
        );
    }
    test_field_apiVersion();
    fn test_field_driverVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).driverVersion) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(driverVersion)
            )
        );
    }
    test_field_driverVersion();
    fn test_field_vendorID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).vendorID) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(vendorID)
            )
        );
    }
    test_field_vendorID();
    fn test_field_deviceID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceID) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(deviceID)
            )
        );
    }
    test_field_deviceID();
    fn test_field_deviceType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceType) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(deviceType)
            )
        );
    }
    test_field_deviceType();
    fn test_field_deviceName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).deviceName) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(deviceName)
            )
        );
    }
    test_field_deviceName();
    fn test_field_pipelineCacheUUID() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pipelineCacheUUID) as usize - ptr as usize
            },
            276usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(pipelineCacheUUID)
            )
        );
    }
    test_field_pipelineCacheUUID();
    fn test_field_limits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).limits) as usize - ptr as usize
            },
            296usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(limits)
            )
        );
    }
    test_field_limits();
    fn test_field_sparseProperties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkPhysicalDeviceProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sparseProperties) as usize - ptr as usize
            },
            800usize,
            concat!(
                "Offset of field: ",
                stringify!(VkPhysicalDeviceProperties),
                "::",
                stringify!(sparseProperties)
            )
        );
    }
    test_field_sparseProperties();
}
impl Default for VkPhysicalDeviceProperties {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkQueueFamilyProperties {
    pub queueFlags: VkQueueFlags,
    pub queueCount: u32,
    pub timestampValidBits: u32,
    pub minImageTransferGranularity: VkExtent3D,
}
#[test]
fn bindgen_test_layout_VkQueueFamilyProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkQueueFamilyProperties>(),
        24usize,
        concat!("Size of: ", stringify!(VkQueueFamilyProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkQueueFamilyProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(VkQueueFamilyProperties))
    );
    fn test_field_queueFlags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueueFamilyProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueFlags) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueueFamilyProperties),
                "::",
                stringify!(queueFlags)
            )
        );
    }
    test_field_queueFlags();
    fn test_field_queueCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueueFamilyProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueCount) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueueFamilyProperties),
                "::",
                stringify!(queueCount)
            )
        );
    }
    test_field_queueCount();
    fn test_field_timestampValidBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueueFamilyProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).timestampValidBits) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueueFamilyProperties),
                "::",
                stringify!(timestampValidBits)
            )
        );
    }
    test_field_timestampValidBits();
    fn test_field_minImageTransferGranularity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueueFamilyProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minImageTransferGranularity) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueueFamilyProperties),
                "::",
                stringify!(minImageTransferGranularity)
            )
        );
    }
    test_field_minImageTransferGranularity();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDeviceQueueCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkDeviceQueueCreateFlags,
    pub queueFamilyIndex: u32,
    pub queueCount: u32,
    pub pQueuePriorities: *const f32,
}
#[test]
fn bindgen_test_layout_VkDeviceQueueCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkDeviceQueueCreateInfo>(),
        40usize,
        concat!("Size of: ", stringify!(VkDeviceQueueCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkDeviceQueueCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkDeviceQueueCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_queueFamilyIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueFamilyIndex) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(queueFamilyIndex)
            )
        );
    }
    test_field_queueFamilyIndex();
    fn test_field_queueCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueCount) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(queueCount)
            )
        );
    }
    test_field_queueCount();
    fn test_field_pQueuePriorities() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceQueueCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pQueuePriorities) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceQueueCreateInfo),
                "::",
                stringify!(pQueuePriorities)
            )
        );
    }
    test_field_pQueuePriorities();
}
impl Default for VkDeviceQueueCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkDeviceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkDeviceCreateFlags,
    pub queueCreateInfoCount: u32,
    pub pQueueCreateInfos: *const VkDeviceQueueCreateInfo,
    pub enabledLayerCount: u32,
    pub ppEnabledLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub ppEnabledExtensionNames: *const *const ::std::os::raw::c_char,
    pub pEnabledFeatures: *const VkPhysicalDeviceFeatures,
}
#[test]
fn bindgen_test_layout_VkDeviceCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkDeviceCreateInfo>(),
        72usize,
        concat!("Size of: ", stringify!(VkDeviceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkDeviceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkDeviceCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_queueCreateInfoCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueCreateInfoCount) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(queueCreateInfoCount)
            )
        );
    }
    test_field_queueCreateInfoCount();
    fn test_field_pQueueCreateInfos() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pQueueCreateInfos) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(pQueueCreateInfos)
            )
        );
    }
    test_field_pQueueCreateInfos();
    fn test_field_enabledLayerCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enabledLayerCount) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(enabledLayerCount)
            )
        );
    }
    test_field_enabledLayerCount();
    fn test_field_ppEnabledLayerNames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ppEnabledLayerNames) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(ppEnabledLayerNames)
            )
        );
    }
    test_field_ppEnabledLayerNames();
    fn test_field_enabledExtensionCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).enabledExtensionCount) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(enabledExtensionCount)
            )
        );
    }
    test_field_enabledExtensionCount();
    fn test_field_ppEnabledExtensionNames() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).ppEnabledExtensionNames) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(ppEnabledExtensionNames)
            )
        );
    }
    test_field_ppEnabledExtensionNames();
    fn test_field_pEnabledFeatures() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkDeviceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pEnabledFeatures) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkDeviceCreateInfo),
                "::",
                stringify!(pEnabledFeatures)
            )
        );
    }
    test_field_pEnabledFeatures();
}
impl Default for VkDeviceCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkExtensionProperties {
    pub extensionName: [::std::os::raw::c_char; 256usize],
    pub specVersion: u32,
}
#[test]
fn bindgen_test_layout_VkExtensionProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkExtensionProperties>(),
        260usize,
        concat!("Size of: ", stringify!(VkExtensionProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkExtensionProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(VkExtensionProperties))
    );
    fn test_field_extensionName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtensionProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).extensionName) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtensionProperties),
                "::",
                stringify!(extensionName)
            )
        );
    }
    test_field_extensionName();
    fn test_field_specVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkExtensionProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).specVersion) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(VkExtensionProperties),
                "::",
                stringify!(specVersion)
            )
        );
    }
    test_field_specVersion();
}
impl Default for VkExtensionProperties {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkLayerProperties {
    pub layerName: [::std::os::raw::c_char; 256usize],
    pub specVersion: u32,
    pub implementationVersion: u32,
    pub description: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_VkLayerProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkLayerProperties>(),
        520usize,
        concat!("Size of: ", stringify!(VkLayerProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkLayerProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(VkLayerProperties))
    );
    fn test_field_layerName() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkLayerProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).layerName) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkLayerProperties),
                "::",
                stringify!(layerName)
            )
        );
    }
    test_field_layerName();
    fn test_field_specVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkLayerProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).specVersion) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(VkLayerProperties),
                "::",
                stringify!(specVersion)
            )
        );
    }
    test_field_specVersion();
    fn test_field_implementationVersion() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkLayerProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).implementationVersion) as usize - ptr as usize
            },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(VkLayerProperties),
                "::",
                stringify!(implementationVersion)
            )
        );
    }
    test_field_implementationVersion();
    fn test_field_description() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkLayerProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(VkLayerProperties),
                "::",
                stringify!(description)
            )
        );
    }
    test_field_description();
}
impl Default for VkLayerProperties {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSubmitInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub waitSemaphoreCount: u32,
    pub pWaitSemaphores: *const VkSemaphore,
    pub pWaitDstStageMask: *const VkPipelineStageFlags,
    pub commandBufferCount: u32,
    pub pCommandBuffers: *const VkCommandBuffer,
    pub signalSemaphoreCount: u32,
    pub pSignalSemaphores: *const VkSemaphore,
}
#[test]
fn bindgen_test_layout_VkSubmitInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkSubmitInfo>(),
        72usize,
        concat!("Size of: ", stringify!(VkSubmitInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSubmitInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSubmitInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_waitSemaphoreCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).waitSemaphoreCount) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(waitSemaphoreCount)
            )
        );
    }
    test_field_waitSemaphoreCount();
    fn test_field_pWaitSemaphores() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pWaitSemaphores) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(pWaitSemaphores)
            )
        );
    }
    test_field_pWaitSemaphores();
    fn test_field_pWaitDstStageMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pWaitDstStageMask) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(pWaitDstStageMask)
            )
        );
    }
    test_field_pWaitDstStageMask();
    fn test_field_commandBufferCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).commandBufferCount) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(commandBufferCount)
            )
        );
    }
    test_field_commandBufferCount();
    fn test_field_pCommandBuffers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pCommandBuffers) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(pCommandBuffers)
            )
        );
    }
    test_field_pCommandBuffers();
    fn test_field_signalSemaphoreCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).signalSemaphoreCount) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(signalSemaphoreCount)
            )
        );
    }
    test_field_signalSemaphoreCount();
    fn test_field_pSignalSemaphores() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubmitInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pSignalSemaphores) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubmitInfo),
                "::",
                stringify!(pSignalSemaphores)
            )
        );
    }
    test_field_pSignalSemaphores();
}
impl Default for VkSubmitInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkMappedMemoryRange {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub memory: VkDeviceMemory,
    pub offset: VkDeviceSize,
    pub size: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkMappedMemoryRange() {
    assert_eq!(
        ::std::mem::size_of::<VkMappedMemoryRange>(),
        40usize,
        concat!("Size of: ", stringify!(VkMappedMemoryRange))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMappedMemoryRange>(),
        8usize,
        concat!("Alignment of ", stringify!(VkMappedMemoryRange))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMappedMemoryRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMappedMemoryRange),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMappedMemoryRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMappedMemoryRange),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_memory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMappedMemoryRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMappedMemoryRange),
                "::",
                stringify!(memory)
            )
        );
    }
    test_field_memory();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMappedMemoryRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMappedMemoryRange),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMappedMemoryRange>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMappedMemoryRange),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
}
impl Default for VkMappedMemoryRange {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkMemoryAllocateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub allocationSize: VkDeviceSize,
    pub memoryTypeIndex: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryAllocateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkMemoryAllocateInfo>(),
        32usize,
        concat!("Size of: ", stringify!(VkMemoryAllocateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMemoryAllocateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkMemoryAllocateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryAllocateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryAllocateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryAllocateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryAllocateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_allocationSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryAllocateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).allocationSize) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryAllocateInfo),
                "::",
                stringify!(allocationSize)
            )
        );
    }
    test_field_allocationSize();
    fn test_field_memoryTypeIndex() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryAllocateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryTypeIndex) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryAllocateInfo),
                "::",
                stringify!(memoryTypeIndex)
            )
        );
    }
    test_field_memoryTypeIndex();
}
impl Default for VkMemoryAllocateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkMemoryRequirements {
    pub size: VkDeviceSize,
    pub alignment: VkDeviceSize,
    pub memoryTypeBits: u32,
}
#[test]
fn bindgen_test_layout_VkMemoryRequirements() {
    assert_eq!(
        ::std::mem::size_of::<VkMemoryRequirements>(),
        24usize,
        concat!("Size of: ", stringify!(VkMemoryRequirements))
    );
    assert_eq!(
        ::std::mem::align_of::<VkMemoryRequirements>(),
        8usize,
        concat!("Alignment of ", stringify!(VkMemoryRequirements))
    );
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryRequirements),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_alignment() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alignment) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryRequirements),
                "::",
                stringify!(alignment)
            )
        );
    }
    test_field_alignment();
    fn test_field_memoryTypeBits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryTypeBits) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkMemoryRequirements),
                "::",
                stringify!(memoryTypeBits)
            )
        );
    }
    test_field_memoryTypeBits();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSparseMemoryBind {
    pub resourceOffset: VkDeviceSize,
    pub size: VkDeviceSize,
    pub memory: VkDeviceMemory,
    pub memoryOffset: VkDeviceSize,
    pub flags: VkSparseMemoryBindFlags,
}
#[test]
fn bindgen_test_layout_VkSparseMemoryBind() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseMemoryBind>(),
        40usize,
        concat!("Size of: ", stringify!(VkSparseMemoryBind))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseMemoryBind>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSparseMemoryBind))
    );
    fn test_field_resourceOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).resourceOffset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseMemoryBind),
                "::",
                stringify!(resourceOffset)
            )
        );
    }
    test_field_resourceOffset();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseMemoryBind),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_memory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memory) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseMemoryBind),
                "::",
                stringify!(memory)
            )
        );
    }
    test_field_memory();
    fn test_field_memoryOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryOffset) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseMemoryBind),
                "::",
                stringify!(memoryOffset)
            )
        );
    }
    test_field_memoryOffset();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseMemoryBind),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
impl Default for VkSparseMemoryBind {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSparseBufferMemoryBindInfo {
    pub buffer: VkBuffer,
    pub bindCount: u32,
    pub pBinds: *const VkSparseMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseBufferMemoryBindInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseBufferMemoryBindInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkSparseBufferMemoryBindInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseBufferMemoryBindInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSparseBufferMemoryBindInfo))
    );
    fn test_field_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseBufferMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseBufferMemoryBindInfo),
                "::",
                stringify!(buffer)
            )
        );
    }
    test_field_buffer();
    fn test_field_bindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseBufferMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bindCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseBufferMemoryBindInfo),
                "::",
                stringify!(bindCount)
            )
        );
    }
    test_field_bindCount();
    fn test_field_pBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseBufferMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pBinds) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseBufferMemoryBindInfo),
                "::",
                stringify!(pBinds)
            )
        );
    }
    test_field_pBinds();
}
impl Default for VkSparseBufferMemoryBindInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSparseImageOpaqueMemoryBindInfo {
    pub image: VkImage,
    pub bindCount: u32,
    pub pBinds: *const VkSparseMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseImageOpaqueMemoryBindInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseImageOpaqueMemoryBindInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkSparseImageOpaqueMemoryBindInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseImageOpaqueMemoryBindInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(VkSparseImageOpaqueMemoryBindInfo)
        )
    );
    fn test_field_image() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageOpaqueMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).image) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageOpaqueMemoryBindInfo),
                "::",
                stringify!(image)
            )
        );
    }
    test_field_image();
    fn test_field_bindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageOpaqueMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bindCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageOpaqueMemoryBindInfo),
                "::",
                stringify!(bindCount)
            )
        );
    }
    test_field_bindCount();
    fn test_field_pBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageOpaqueMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pBinds) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageOpaqueMemoryBindInfo),
                "::",
                stringify!(pBinds)
            )
        );
    }
    test_field_pBinds();
}
impl Default for VkSparseImageOpaqueMemoryBindInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkImageSubresource {
    pub aspectMask: VkImageAspectFlags,
    pub mipLevel: u32,
    pub arrayLayer: u32,
}
#[test]
fn bindgen_test_layout_VkImageSubresource() {
    assert_eq!(
        ::std::mem::size_of::<VkImageSubresource>(),
        12usize,
        concat!("Size of: ", stringify!(VkImageSubresource))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageSubresource>(),
        4usize,
        concat!("Alignment of ", stringify!(VkImageSubresource))
    );
    fn test_field_aspectMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresource>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspectMask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresource),
                "::",
                stringify!(aspectMask)
            )
        );
    }
    test_field_aspectMask();
    fn test_field_mipLevel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresource>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mipLevel) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresource),
                "::",
                stringify!(mipLevel)
            )
        );
    }
    test_field_mipLevel();
    fn test_field_arrayLayer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageSubresource>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arrayLayer) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageSubresource),
                "::",
                stringify!(arrayLayer)
            )
        );
    }
    test_field_arrayLayer();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSparseImageMemoryBind {
    pub subresource: VkImageSubresource,
    pub offset: VkOffset3D,
    pub extent: VkExtent3D,
    pub memory: VkDeviceMemory,
    pub memoryOffset: VkDeviceSize,
    pub flags: VkSparseMemoryBindFlags,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryBind() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseImageMemoryBind>(),
        64usize,
        concat!("Size of: ", stringify!(VkSparseImageMemoryBind))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseImageMemoryBind>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSparseImageMemoryBind))
    );
    fn test_field_subresource() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subresource) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(subresource)
            )
        );
    }
    test_field_subresource();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_extent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(extent)
            )
        );
    }
    test_field_extent();
    fn test_field_memory() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memory) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(memory)
            )
        );
    }
    test_field_memory();
    fn test_field_memoryOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).memoryOffset) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(memoryOffset)
            )
        );
    }
    test_field_memoryOffset();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBind),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
impl Default for VkSparseImageMemoryBind {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSparseImageMemoryBindInfo {
    pub image: VkImage,
    pub bindCount: u32,
    pub pBinds: *const VkSparseImageMemoryBind,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryBindInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseImageMemoryBindInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkSparseImageMemoryBindInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseImageMemoryBindInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSparseImageMemoryBindInfo))
    );
    fn test_field_image() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).image) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBindInfo),
                "::",
                stringify!(image)
            )
        );
    }
    test_field_image();
    fn test_field_bindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bindCount) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBindInfo),
                "::",
                stringify!(bindCount)
            )
        );
    }
    test_field_bindCount();
    fn test_field_pBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryBindInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pBinds) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryBindInfo),
                "::",
                stringify!(pBinds)
            )
        );
    }
    test_field_pBinds();
}
impl Default for VkSparseImageMemoryBindInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBindSparseInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub waitSemaphoreCount: u32,
    pub pWaitSemaphores: *const VkSemaphore,
    pub bufferBindCount: u32,
    pub pBufferBinds: *const VkSparseBufferMemoryBindInfo,
    pub imageOpaqueBindCount: u32,
    pub pImageOpaqueBinds: *const VkSparseImageOpaqueMemoryBindInfo,
    pub imageBindCount: u32,
    pub pImageBinds: *const VkSparseImageMemoryBindInfo,
    pub signalSemaphoreCount: u32,
    pub pSignalSemaphores: *const VkSemaphore,
}
#[test]
fn bindgen_test_layout_VkBindSparseInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkBindSparseInfo>(),
        96usize,
        concat!("Size of: ", stringify!(VkBindSparseInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBindSparseInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBindSparseInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_waitSemaphoreCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).waitSemaphoreCount) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(waitSemaphoreCount)
            )
        );
    }
    test_field_waitSemaphoreCount();
    fn test_field_pWaitSemaphores() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pWaitSemaphores) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pWaitSemaphores)
            )
        );
    }
    test_field_pWaitSemaphores();
    fn test_field_bufferBindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).bufferBindCount) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(bufferBindCount)
            )
        );
    }
    test_field_bufferBindCount();
    fn test_field_pBufferBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pBufferBinds) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pBufferBinds)
            )
        );
    }
    test_field_pBufferBinds();
    fn test_field_imageOpaqueBindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageOpaqueBindCount) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(imageOpaqueBindCount)
            )
        );
    }
    test_field_imageOpaqueBindCount();
    fn test_field_pImageOpaqueBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pImageOpaqueBinds) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pImageOpaqueBinds)
            )
        );
    }
    test_field_pImageOpaqueBinds();
    fn test_field_imageBindCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageBindCount) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(imageBindCount)
            )
        );
    }
    test_field_imageBindCount();
    fn test_field_pImageBinds() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pImageBinds) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pImageBinds)
            )
        );
    }
    test_field_pImageBinds();
    fn test_field_signalSemaphoreCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).signalSemaphoreCount) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(signalSemaphoreCount)
            )
        );
    }
    test_field_signalSemaphoreCount();
    fn test_field_pSignalSemaphores() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBindSparseInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pSignalSemaphores) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBindSparseInfo),
                "::",
                stringify!(pSignalSemaphores)
            )
        );
    }
    test_field_pSignalSemaphores();
}
impl Default for VkBindSparseInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkSparseImageFormatProperties {
    pub aspectMask: VkImageAspectFlags,
    pub imageGranularity: VkExtent3D,
    pub flags: VkSparseImageFormatFlags,
}
#[test]
fn bindgen_test_layout_VkSparseImageFormatProperties() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseImageFormatProperties>(),
        20usize,
        concat!("Size of: ", stringify!(VkSparseImageFormatProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseImageFormatProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(VkSparseImageFormatProperties))
    );
    fn test_field_aspectMask() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).aspectMask) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageFormatProperties),
                "::",
                stringify!(aspectMask)
            )
        );
    }
    test_field_aspectMask();
    fn test_field_imageGranularity() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageGranularity) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageFormatProperties),
                "::",
                stringify!(imageGranularity)
            )
        );
    }
    test_field_imageGranularity();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageFormatProperties>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageFormatProperties),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkSparseImageMemoryRequirements {
    pub formatProperties: VkSparseImageFormatProperties,
    pub imageMipTailFirstLod: u32,
    pub imageMipTailSize: VkDeviceSize,
    pub imageMipTailOffset: VkDeviceSize,
    pub imageMipTailStride: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkSparseImageMemoryRequirements() {
    assert_eq!(
        ::std::mem::size_of::<VkSparseImageMemoryRequirements>(),
        48usize,
        concat!("Size of: ", stringify!(VkSparseImageMemoryRequirements))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSparseImageMemoryRequirements>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSparseImageMemoryRequirements))
    );
    fn test_field_formatProperties() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).formatProperties) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryRequirements),
                "::",
                stringify!(formatProperties)
            )
        );
    }
    test_field_formatProperties();
    fn test_field_imageMipTailFirstLod() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageMipTailFirstLod) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryRequirements),
                "::",
                stringify!(imageMipTailFirstLod)
            )
        );
    }
    test_field_imageMipTailFirstLod();
    fn test_field_imageMipTailSize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageMipTailSize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryRequirements),
                "::",
                stringify!(imageMipTailSize)
            )
        );
    }
    test_field_imageMipTailSize();
    fn test_field_imageMipTailOffset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageMipTailOffset) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryRequirements),
                "::",
                stringify!(imageMipTailOffset)
            )
        );
    }
    test_field_imageMipTailOffset();
    fn test_field_imageMipTailStride() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSparseImageMemoryRequirements>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageMipTailStride) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSparseImageMemoryRequirements),
                "::",
                stringify!(imageMipTailStride)
            )
        );
    }
    test_field_imageMipTailStride();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkFenceCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkFenceCreateFlags,
}
#[test]
fn bindgen_test_layout_VkFenceCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkFenceCreateInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkFenceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkFenceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkFenceCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFenceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFenceCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFenceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFenceCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkFenceCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkFenceCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
impl Default for VkFenceCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkSemaphoreCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkSemaphoreCreateFlags,
}
#[test]
fn bindgen_test_layout_VkSemaphoreCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkSemaphoreCreateInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkSemaphoreCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSemaphoreCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSemaphoreCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSemaphoreCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSemaphoreCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSemaphoreCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSemaphoreCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSemaphoreCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSemaphoreCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
impl Default for VkSemaphoreCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkEventCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkEventCreateFlags,
}
#[test]
fn bindgen_test_layout_VkEventCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkEventCreateInfo>(),
        24usize,
        concat!("Size of: ", stringify!(VkEventCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkEventCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkEventCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkEventCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkEventCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkEventCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkEventCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkEventCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkEventCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
}
impl Default for VkEventCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkQueryPoolCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkQueryPoolCreateFlags,
    pub queryType: VkQueryType,
    pub queryCount: u32,
    pub pipelineStatistics: VkQueryPipelineStatisticFlags,
}
#[test]
fn bindgen_test_layout_VkQueryPoolCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkQueryPoolCreateInfo>(),
        32usize,
        concat!("Size of: ", stringify!(VkQueryPoolCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkQueryPoolCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkQueryPoolCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_queryType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queryType) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(queryType)
            )
        );
    }
    test_field_queryType();
    fn test_field_queryCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queryCount) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(queryCount)
            )
        );
    }
    test_field_queryCount();
    fn test_field_pipelineStatistics() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkQueryPoolCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pipelineStatistics) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkQueryPoolCreateInfo),
                "::",
                stringify!(pipelineStatistics)
            )
        );
    }
    test_field_pipelineStatistics();
}
impl Default for VkQueryPoolCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBufferCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkBufferCreateFlags,
    pub size: VkDeviceSize,
    pub usage: VkBufferUsageFlags,
    pub sharingMode: VkSharingMode,
    pub queueFamilyIndexCount: u32,
    pub pQueueFamilyIndices: *const u32,
}
#[test]
fn bindgen_test_layout_VkBufferCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkBufferCreateInfo>(),
        56usize,
        concat!("Size of: ", stringify!(VkBufferCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBufferCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBufferCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_usage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(usage)
            )
        );
    }
    test_field_usage();
    fn test_field_sharingMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sharingMode) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(sharingMode)
            )
        );
    }
    test_field_sharingMode();
    fn test_field_queueFamilyIndexCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueFamilyIndexCount) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(queueFamilyIndexCount)
            )
        );
    }
    test_field_queueFamilyIndexCount();
    fn test_field_pQueueFamilyIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pQueueFamilyIndices) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferCreateInfo),
                "::",
                stringify!(pQueueFamilyIndices)
            )
        );
    }
    test_field_pQueueFamilyIndices();
}
impl Default for VkBufferCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkBufferViewCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkBufferViewCreateFlags,
    pub buffer: VkBuffer,
    pub format: VkFormat,
    pub offset: VkDeviceSize,
    pub range: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkBufferViewCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkBufferViewCreateInfo>(),
        56usize,
        concat!("Size of: ", stringify!(VkBufferViewCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkBufferViewCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkBufferViewCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_buffer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).buffer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(buffer)
            )
        );
    }
    test_field_buffer();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_range() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkBufferViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkBufferViewCreateInfo),
                "::",
                stringify!(range)
            )
        );
    }
    test_field_range();
}
impl Default for VkBufferViewCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkImageCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkImageCreateFlags,
    pub imageType: VkImageType,
    pub format: VkFormat,
    pub extent: VkExtent3D,
    pub mipLevels: u32,
    pub arrayLayers: u32,
    pub samples: VkSampleCountFlagBits,
    pub tiling: VkImageTiling,
    pub usage: VkImageUsageFlags,
    pub sharingMode: VkSharingMode,
    pub queueFamilyIndexCount: u32,
    pub pQueueFamilyIndices: *const u32,
    pub initialLayout: VkImageLayout,
}
#[test]
fn bindgen_test_layout_VkImageCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkImageCreateInfo>(),
        88usize,
        concat!("Size of: ", stringify!(VkImageCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkImageCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_imageType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).imageType) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(imageType)
            )
        );
    }
    test_field_imageType();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_extent() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(extent)
            )
        );
    }
    test_field_extent();
    fn test_field_mipLevels() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).mipLevels) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(mipLevels)
            )
        );
    }
    test_field_mipLevels();
    fn test_field_arrayLayers() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arrayLayers) as usize - ptr as usize
            },
            44usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(arrayLayers)
            )
        );
    }
    test_field_arrayLayers();
    fn test_field_samples() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).samples) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(samples)
            )
        );
    }
    test_field_samples();
    fn test_field_tiling() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).tiling) as usize - ptr as usize
            },
            52usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(tiling)
            )
        );
    }
    test_field_tiling();
    fn test_field_usage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(usage)
            )
        );
    }
    test_field_usage();
    fn test_field_sharingMode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sharingMode) as usize - ptr as usize
            },
            60usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(sharingMode)
            )
        );
    }
    test_field_sharingMode();
    fn test_field_queueFamilyIndexCount() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).queueFamilyIndexCount) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(queueFamilyIndexCount)
            )
        );
    }
    test_field_queueFamilyIndexCount();
    fn test_field_pQueueFamilyIndices() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pQueueFamilyIndices) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(pQueueFamilyIndices)
            )
        );
    }
    test_field_pQueueFamilyIndices();
    fn test_field_initialLayout() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).initialLayout) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageCreateInfo),
                "::",
                stringify!(initialLayout)
            )
        );
    }
    test_field_initialLayout();
}
impl Default for VkImageCreateInfo {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct VkSubresourceLayout {
    pub offset: VkDeviceSize,
    pub size: VkDeviceSize,
    pub rowPitch: VkDeviceSize,
    pub arrayPitch: VkDeviceSize,
    pub depthPitch: VkDeviceSize,
}
#[test]
fn bindgen_test_layout_VkSubresourceLayout() {
    assert_eq!(
        ::std::mem::size_of::<VkSubresourceLayout>(),
        40usize,
        concat!("Size of: ", stringify!(VkSubresourceLayout))
    );
    assert_eq!(
        ::std::mem::align_of::<VkSubresourceLayout>(),
        8usize,
        concat!("Alignment of ", stringify!(VkSubresourceLayout))
    );
    fn test_field_offset() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubresourceLayout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubresourceLayout),
                "::",
                stringify!(offset)
            )
        );
    }
    test_field_offset();
    fn test_field_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubresourceLayout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubresourceLayout),
                "::",
                stringify!(size)
            )
        );
    }
    test_field_size();
    fn test_field_rowPitch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubresourceLayout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rowPitch) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubresourceLayout),
                "::",
                stringify!(rowPitch)
            )
        );
    }
    test_field_rowPitch();
    fn test_field_arrayPitch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubresourceLayout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).arrayPitch) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubresourceLayout),
                "::",
                stringify!(arrayPitch)
            )
        );
    }
    test_field_arrayPitch();
    fn test_field_depthPitch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkSubresourceLayout>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).depthPitch) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkSubresourceLayout),
                "::",
                stringify!(depthPitch)
            )
        );
    }
    test_field_depthPitch();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkComponentMapping {
    pub r: VkComponentSwizzle,
    pub g: VkComponentSwizzle,
    pub b: VkComponentSwizzle,
    pub a: VkComponentSwizzle,
}
#[test]
fn bindgen_test_layout_VkComponentMapping() {
    assert_eq!(
        ::std::mem::size_of::<VkComponentMapping>(),
        16usize,
        concat!("Size of: ", stringify!(VkComponentMapping))
    );
    assert_eq!(
        ::std::mem::align_of::<VkComponentMapping>(),
        4usize,
        concat!("Alignment of ", stringify!(VkComponentMapping))
    );
    fn test_field_r() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkComponentMapping>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkComponentMapping),
                "::",
                stringify!(r)
            )
        );
    }
    test_field_r();
    fn test_field_g() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkComponentMapping>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(VkComponentMapping),
                "::",
                stringify!(g)
            )
        );
    }
    test_field_g();
    fn test_field_b() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkComponentMapping>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkComponentMapping),
                "::",
                stringify!(b)
            )
        );
    }
    test_field_b();
    fn test_field_a() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkComponentMapping>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(VkComponentMapping),
                "::",
                stringify!(a)
            )
        );
    }
    test_field_a();
}
impl Default for VkComponentMapping {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct VkImageViewCreateInfo {
    pub sType: VkStructureType,
    pub pNext: *const ::std::os::raw::c_void,
    pub flags: VkImageViewCreateFlags,
    pub image: VkImage,
    pub viewType: VkImageViewType,
    pub format: VkFormat,
    pub components: VkComponentMapping,
    pub subresourceRange: VkImageSubresourceRange,
}
#[test]
fn bindgen_test_layout_VkImageViewCreateInfo() {
    assert_eq!(
        ::std::mem::size_of::<VkImageViewCreateInfo>(),
        80usize,
        concat!("Size of: ", stringify!(VkImageViewCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<VkImageViewCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(VkImageViewCreateInfo))
    );
    fn test_field_sType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).sType) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(sType)
            )
        );
    }
    test_field_sType();
    fn test_field_pNext() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).pNext) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(pNext)
            )
        );
    }
    test_field_pNext();
    fn test_field_flags() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(flags)
            )
        );
    }
    test_field_flags();
    fn test_field_image() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).image) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(image)
            )
        );
    }
    test_field_image();
    fn test_field_viewType() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).viewType) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(viewType)
            )
        );
    }
    test_field_viewType();
    fn test_field_format() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize
            },
            36usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(format)
            )
        );
    }
    test_field_format();
    fn test_field_components() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).components) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
                stringify!(components)
            )
        );
    }
    test_field_components();
    fn test_field_subresourceRange() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<VkImageViewCreateInfo>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).subresourceRange) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(VkImageViewCreateInfo),
                "::",
